/* automatically generated by rust-bindgen 0.72.0 */

#[doc = r" If Bindgen could only determine the size and alignment of a"]
#[doc = r" type, it is represented like this."]
#[derive(PartialEq, Copy, Clone, Debug, Hash)]
#[repr(C)]
pub struct __BindgenOpaqueArray<T: Copy, const N: usize>(pub [T; N]);
impl<T: Copy + Default, const N: usize> Default for __BindgenOpaqueArray<T, N> {
    fn default() -> Self {
        Self([<T as Default>::default(); N])
    }
}
#[derive(PartialEq, Copy, Clone, Hash, Debug, Default)]
#[repr(transparent)]
pub struct __BindgenFloat16(pub u16);
pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_CXX26: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _CRT_HAS_C11: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;

pub const NVSDK_NGX_Parameter_DLSSDOptimalSettingsCallback: &[u8; 29] =
    b"DLSSDOptimalSettingsCallback\0";
pub const NVSDK_NGX_Parameter_DLSSDGetStatsCallback: &[u8; 22] = b"DLSSDGetStatsCallback\0";
pub const NVSDK_NGX_Parameter_RayReconstruction_Hint_Render_Preset_DLAA: &[u8; 42] =
    b"RayReconstruction.Hint.Render.Preset.DLAA\0";
pub const NVSDK_NGX_Parameter_RayReconstruction_Hint_Render_Preset_Quality: &[u8; 45] =
    b"RayReconstruction.Hint.Render.Preset.Quality\0";
pub const NVSDK_NGX_Parameter_RayReconstruction_Hint_Render_Preset_Balanced: &[u8; 46] =
    b"RayReconstruction.Hint.Render.Preset.Balanced\0";
pub const NVSDK_NGX_Parameter_RayReconstruction_Hint_Render_Preset_Performance: &[u8; 49] =
    b"RayReconstruction.Hint.Render.Preset.Performance\0";
pub const NVSDK_NGX_Parameter_RayReconstruction_Hint_Render_Preset_UltraPerformance: &[u8; 54] =
    b"RayReconstruction.Hint.Render.Preset.UltraPerformance\0";
pub const NVSDK_NGX_Parameter_RayReconstruction_Hint_Render_Preset_UltraQuality: &[u8; 50] =
    b"RayReconstruction.Hint.Render.Preset.UltraQuality\0";
pub type max_align_t = f64;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_data_public> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        "Size of __crt_locale_data_public"
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        "Alignment of __crt_locale_data_public"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize },
        0usize,
        "Offset of field: __crt_locale_data_public::_locale_pctype"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize },
        8usize,
        "Offset of field: __crt_locale_data_public::_locale_mb_cur_max"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize },
        12usize,
        "Offset of field: __crt_locale_data_public::_locale_lc_codepage"
    );
}
impl Default for __crt_locale_data_public {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_pointers> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        "Size of __crt_locale_pointers"
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        "Alignment of __crt_locale_pointers"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize },
        0usize,
        "Offset of field: __crt_locale_pointers::locinfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize },
        8usize,
        "Offset of field: __crt_locale_pointers::mbcinfo"
    );
}
impl Default for __crt_locale_pointers {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    const UNINIT: ::std::mem::MaybeUninit<_Mbstatet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_Mbstatet>(),
        8usize,
        "Size of _Mbstatet"
    );
    assert_eq!(
        ::std::mem::align_of::<_Mbstatet>(),
        4usize,
        "Alignment of _Mbstatet"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize },
        0usize,
        "Offset of field: _Mbstatet::_Wchar"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize },
        4usize,
        "Offset of field: _Mbstatet::_Byte"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._State) as usize - ptr as usize },
        6usize,
        "Offset of field: _Mbstatet::_State"
    );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn __doserrno() -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _set_doserrno(_Value: ::std::os::raw::c_ulong) -> errno_t;
}
extern "C" {
    pub fn _get_doserrno(_Value: *mut ::std::os::raw::c_ulong) -> errno_t;
}
extern "C" {
    pub fn memchr(
        _Buf: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _MaxCount: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memcpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        _Dst: *mut ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strchr(
        _Str: *const ::std::os::raw::c_char,
        _Val: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        _Str: *const ::std::os::raw::c_char,
        _Ch: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        _Str: *const ::std::os::raw::c_char,
        _SubStr: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn wcschr(
        _Str: *const ::std::os::raw::c_ushort,
        _Ch: ::std::os::raw::c_ushort,
    ) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn wcsrchr(_Str: *const wchar_t, _Ch: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsstr(_Str: *const wchar_t, _SubStr: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _cgetws_s(_Buffer: *mut wchar_t, _BufferCount: usize, _SizeRead: *mut usize) -> errno_t;
}
extern "C" {
    pub fn _cputws(_Buffer: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _getwch() -> wint_t;
}
extern "C" {
    pub fn _getwche() -> wint_t;
}
extern "C" {
    pub fn _putwch(_Character: wchar_t) -> wint_t;
}
extern "C" {
    pub fn _ungetwch(_Character: wint_t) -> wint_t;
}
extern "C" {
    pub fn _getwch_nolock() -> wint_t;
}
extern "C" {
    pub fn _getwche_nolock() -> wint_t;
}
extern "C" {
    pub fn _putwch_nolock(_Character: wchar_t) -> wint_t;
}
extern "C" {
    pub fn _ungetwch_nolock(_Character: wint_t) -> wint_t;
}
extern "C" {
    pub fn __conio_common_vcwprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __conio_common_vcwprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __conio_common_vcwprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __conio_common_vcwscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __pctype_func() -> *const ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn __pwctype_func() -> *const wctype_t;
}
extern "C" {
    pub fn iswalnum(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswalpha(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswascii(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswblank(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswcntrl(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswdigit(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswgraph(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswlower(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswprint(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswpunct(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswspace(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswupper(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswxdigit(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iswcsymf(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iswcsym(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswalnum_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswalpha_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswblank_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswcntrl_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswdigit_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswgraph_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswlower_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswprint_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswpunct_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswspace_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswupper_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswxdigit_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswcsymf_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswcsym_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn towupper(_C: wint_t) -> wint_t;
}
extern "C" {
    pub fn towlower(_C: wint_t) -> wint_t;
}
extern "C" {
    pub fn iswctype(_C: wint_t, _Type: wctype_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _towupper_l(_C: wint_t, _Locale: _locale_t) -> wint_t;
}
extern "C" {
    pub fn _towlower_l(_C: wint_t, _Locale: _locale_t) -> wint_t;
}
extern "C" {
    pub fn _iswctype_l(_C: wint_t, _Type: wctype_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isleadbyte(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _isleadbyte_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn is_wctype(_C: wint_t, _Type: wctype_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wgetcwd(_DstBuf: *mut wchar_t, _SizeInWords: ::std::os::raw::c_int) -> *mut wchar_t;
}
extern "C" {
    pub fn _wgetdcwd(
        _Drive: ::std::os::raw::c_int,
        _DstBuf: *mut wchar_t,
        _SizeInWords: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wchdir(_Path: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wmkdir(_Path: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wrmdir(_Path: *const wchar_t) -> ::std::os::raw::c_int;
}
pub type _fsize_t = ::std::os::raw::c_ulong;
#[repr(C)]
pub struct _wfinddata32_t {
    pub attrib: ::std::os::raw::c_uint,
    pub time_create: __time32_t,
    pub time_access: __time32_t,
    pub time_write: __time32_t,
    pub size: _fsize_t,
    pub name: [wchar_t; 260usize],
}
#[test]
fn bindgen_test_layout__wfinddata32_t() {
    const UNINIT: ::std::mem::MaybeUninit<_wfinddata32_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_wfinddata32_t>(),
        540usize,
        "Size of _wfinddata32_t"
    );
    assert_eq!(
        ::std::mem::align_of::<_wfinddata32_t>(),
        4usize,
        "Alignment of _wfinddata32_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attrib) as usize - ptr as usize },
        0usize,
        "Offset of field: _wfinddata32_t::attrib"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_create) as usize - ptr as usize },
        4usize,
        "Offset of field: _wfinddata32_t::time_create"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_access) as usize - ptr as usize },
        8usize,
        "Offset of field: _wfinddata32_t::time_access"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_write) as usize - ptr as usize },
        12usize,
        "Offset of field: _wfinddata32_t::time_write"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        "Offset of field: _wfinddata32_t::size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        20usize,
        "Offset of field: _wfinddata32_t::name"
    );
}
impl Default for _wfinddata32_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for _wfinddata32_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "_wfinddata32_t {{ attrib: {:?}, time_create: {:?}, time_access: {:?}, time_write: {:?}, size: {:?}, name: {:?} }}" , self . attrib , self . time_create , self . time_access , self . time_write , self . size , self . name)
    }
}
#[repr(C)]
pub struct _wfinddata32i64_t {
    pub attrib: ::std::os::raw::c_uint,
    pub time_create: __time32_t,
    pub time_access: __time32_t,
    pub time_write: __time32_t,
    pub size: ::std::os::raw::c_longlong,
    pub name: [wchar_t; 260usize],
}
#[test]
fn bindgen_test_layout__wfinddata32i64_t() {
    const UNINIT: ::std::mem::MaybeUninit<_wfinddata32i64_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_wfinddata32i64_t>(),
        544usize,
        "Size of _wfinddata32i64_t"
    );
    assert_eq!(
        ::std::mem::align_of::<_wfinddata32i64_t>(),
        8usize,
        "Alignment of _wfinddata32i64_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attrib) as usize - ptr as usize },
        0usize,
        "Offset of field: _wfinddata32i64_t::attrib"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_create) as usize - ptr as usize },
        4usize,
        "Offset of field: _wfinddata32i64_t::time_create"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_access) as usize - ptr as usize },
        8usize,
        "Offset of field: _wfinddata32i64_t::time_access"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_write) as usize - ptr as usize },
        12usize,
        "Offset of field: _wfinddata32i64_t::time_write"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        "Offset of field: _wfinddata32i64_t::size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        24usize,
        "Offset of field: _wfinddata32i64_t::name"
    );
}
impl Default for _wfinddata32i64_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for _wfinddata32i64_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "_wfinddata32i64_t {{ attrib: {:?}, time_create: {:?}, time_access: {:?}, time_write: {:?}, size: {:?}, name: {:?} }}" , self . attrib , self . time_create , self . time_access , self . time_write , self . size , self . name)
    }
}
#[repr(C)]
pub struct _wfinddata64i32_t {
    pub attrib: ::std::os::raw::c_uint,
    pub time_create: __time64_t,
    pub time_access: __time64_t,
    pub time_write: __time64_t,
    pub size: _fsize_t,
    pub name: [wchar_t; 260usize],
}
#[test]
fn bindgen_test_layout__wfinddata64i32_t() {
    const UNINIT: ::std::mem::MaybeUninit<_wfinddata64i32_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_wfinddata64i32_t>(),
        560usize,
        "Size of _wfinddata64i32_t"
    );
    assert_eq!(
        ::std::mem::align_of::<_wfinddata64i32_t>(),
        8usize,
        "Alignment of _wfinddata64i32_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attrib) as usize - ptr as usize },
        0usize,
        "Offset of field: _wfinddata64i32_t::attrib"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_create) as usize - ptr as usize },
        8usize,
        "Offset of field: _wfinddata64i32_t::time_create"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_access) as usize - ptr as usize },
        16usize,
        "Offset of field: _wfinddata64i32_t::time_access"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_write) as usize - ptr as usize },
        24usize,
        "Offset of field: _wfinddata64i32_t::time_write"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        32usize,
        "Offset of field: _wfinddata64i32_t::size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        36usize,
        "Offset of field: _wfinddata64i32_t::name"
    );
}
impl Default for _wfinddata64i32_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for _wfinddata64i32_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "_wfinddata64i32_t {{ attrib: {:?}, time_create: {:?}, time_access: {:?}, time_write: {:?}, size: {:?}, name: {:?} }}" , self . attrib , self . time_create , self . time_access , self . time_write , self . size , self . name)
    }
}
#[repr(C)]
pub struct _wfinddata64_t {
    pub attrib: ::std::os::raw::c_uint,
    pub time_create: __time64_t,
    pub time_access: __time64_t,
    pub time_write: __time64_t,
    pub size: ::std::os::raw::c_longlong,
    pub name: [wchar_t; 260usize],
}
#[test]
fn bindgen_test_layout__wfinddata64_t() {
    const UNINIT: ::std::mem::MaybeUninit<_wfinddata64_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_wfinddata64_t>(),
        560usize,
        "Size of _wfinddata64_t"
    );
    assert_eq!(
        ::std::mem::align_of::<_wfinddata64_t>(),
        8usize,
        "Alignment of _wfinddata64_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attrib) as usize - ptr as usize },
        0usize,
        "Offset of field: _wfinddata64_t::attrib"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_create) as usize - ptr as usize },
        8usize,
        "Offset of field: _wfinddata64_t::time_create"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_access) as usize - ptr as usize },
        16usize,
        "Offset of field: _wfinddata64_t::time_access"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_write) as usize - ptr as usize },
        24usize,
        "Offset of field: _wfinddata64_t::time_write"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        32usize,
        "Offset of field: _wfinddata64_t::size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        40usize,
        "Offset of field: _wfinddata64_t::name"
    );
}
impl Default for _wfinddata64_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for _wfinddata64_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "_wfinddata64_t {{ attrib: {:?}, time_create: {:?}, time_access: {:?}, time_write: {:?}, size: {:?}, name: {:?} }}" , self . attrib , self . time_create , self . time_access , self . time_write , self . size , self . name)
    }
}
extern "C" {
    pub fn _waccess(
        _FileName: *const wchar_t,
        _AccessMode: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _waccess_s(_FileName: *const wchar_t, _AccessMode: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _wchmod(
        _FileName: *const wchar_t,
        _Mode: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcreat(
        _FileName: *const wchar_t,
        _PermissionMode: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wfindfirst32(_FileName: *const wchar_t, _FindData: *mut _wfinddata32_t) -> isize;
}
extern "C" {
    pub fn _wfindnext32(
        _FindHandle: isize,
        _FindData: *mut _wfinddata32_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wunlink(_FileName: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wrename(
        _OldFileName: *const wchar_t,
        _NewFileName: *const wchar_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wmktemp_s(_TemplateName: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
extern "C" {
    pub fn _wmktemp(_TemplateName: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wfindfirst32i64(_FileName: *const wchar_t, _FindData: *mut _wfinddata32i64_t) -> isize;
}
extern "C" {
    pub fn _wfindfirst64i32(_FileName: *const wchar_t, _FindData: *mut _wfinddata64i32_t) -> isize;
}
extern "C" {
    pub fn _wfindfirst64(_FileName: *const wchar_t, _FindData: *mut _wfinddata64_t) -> isize;
}
extern "C" {
    pub fn _wfindnext32i64(
        _FindHandle: isize,
        _FindData: *mut _wfinddata32i64_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wfindnext64i32(
        _FindHandle: isize,
        _FindData: *mut _wfinddata64i32_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wfindnext64(
        _FindHandle: isize,
        _FindData: *mut _wfinddata64_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wsopen_s(
        _FileHandle: *mut ::std::os::raw::c_int,
        _FileName: *const wchar_t,
        _OpenFlag: ::std::os::raw::c_int,
        _ShareFlag: ::std::os::raw::c_int,
        _PermissionFlag: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _wsopen_dispatch(
        _FileName: *const wchar_t,
        _OFlag: ::std::os::raw::c_int,
        _ShFlag: ::std::os::raw::c_int,
        _PMode: ::std::os::raw::c_int,
        _PFileHandle: *mut ::std::os::raw::c_int,
        _BSecure: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _wopen(
        _FileName: *const wchar_t,
        _OpenFlag: ::std::os::raw::c_int,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wsopen(
        _FileName: *const wchar_t,
        _OpenFlag: ::std::os::raw::c_int,
        _ShareFlag: ::std::os::raw::c_int,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wexecl(_FileName: *const wchar_t, _ArgList: *const wchar_t, ...) -> isize;
}
extern "C" {
    pub fn _wexecle(_FileName: *const wchar_t, _ArgList: *const wchar_t, ...) -> isize;
}
extern "C" {
    pub fn _wexeclp(_FileName: *const wchar_t, _ArgList: *const wchar_t, ...) -> isize;
}
extern "C" {
    pub fn _wexeclpe(_FileName: *const wchar_t, _ArgList: *const wchar_t, ...) -> isize;
}
extern "C" {
    pub fn _wexecv(_FileName: *const wchar_t, _ArgList: *const *const wchar_t) -> isize;
}
extern "C" {
    pub fn _wexecve(
        _FileName: *const wchar_t,
        _ArgList: *const *const wchar_t,
        _Env: *const *const wchar_t,
    ) -> isize;
}
extern "C" {
    pub fn _wexecvp(_FileName: *const wchar_t, _ArgList: *const *const wchar_t) -> isize;
}
extern "C" {
    pub fn _wexecvpe(
        _FileName: *const wchar_t,
        _ArgList: *const *const wchar_t,
        _Env: *const *const wchar_t,
    ) -> isize;
}
extern "C" {
    pub fn _wspawnl(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const wchar_t,
        _ArgList: *const wchar_t,
        ...
    ) -> isize;
}
extern "C" {
    pub fn _wspawnle(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const wchar_t,
        _ArgList: *const wchar_t,
        ...
    ) -> isize;
}
extern "C" {
    pub fn _wspawnlp(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const wchar_t,
        _ArgList: *const wchar_t,
        ...
    ) -> isize;
}
extern "C" {
    pub fn _wspawnlpe(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const wchar_t,
        _ArgList: *const wchar_t,
        ...
    ) -> isize;
}
extern "C" {
    pub fn _wspawnv(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const wchar_t,
        _ArgList: *const *const wchar_t,
    ) -> isize;
}
extern "C" {
    pub fn _wspawnve(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const wchar_t,
        _ArgList: *const *const wchar_t,
        _Env: *const *const wchar_t,
    ) -> isize;
}
extern "C" {
    pub fn _wspawnvp(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const wchar_t,
        _ArgList: *const *const wchar_t,
    ) -> isize;
}
extern "C" {
    pub fn _wspawnvpe(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const wchar_t,
        _ArgList: *const *const wchar_t,
        _Env: *const *const wchar_t,
    ) -> isize;
}
extern "C" {
    pub fn _wsystem(_Command: *const wchar_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _iobuf {
    pub _Placeholder: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__iobuf() {
    const UNINIT: ::std::mem::MaybeUninit<_iobuf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(::std::mem::size_of::<_iobuf>(), 8usize, "Size of _iobuf");
    assert_eq!(
        ::std::mem::align_of::<_iobuf>(),
        8usize,
        "Alignment of _iobuf"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Placeholder) as usize - ptr as usize },
        0usize,
        "Offset of field: _iobuf::_Placeholder"
    );
}
impl Default for _iobuf {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type FILE = _iobuf;
extern "C" {
    pub fn __acrt_iob_func(_Ix: ::std::os::raw::c_uint) -> *mut FILE;
}
extern "C" {
    pub fn fgetwc(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fgetwchar() -> wint_t;
}
extern "C" {
    pub fn fputwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fputwchar(_Character: wchar_t) -> wint_t;
}
extern "C" {
    pub fn getwc(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn getwchar() -> wint_t;
}
extern "C" {
    pub fn fgetws(
        _Buffer: *mut wchar_t,
        _BufferCount: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn fputws(_Buffer: *const wchar_t, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _getws_s(_Buffer: *mut wchar_t, _BufferCount: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn putwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn putwchar(_Character: wchar_t) -> wint_t;
}
extern "C" {
    pub fn _putws(_Buffer: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetwc(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _wfdopen(_FileHandle: ::std::os::raw::c_int, _Mode: *const wchar_t) -> *mut FILE;
}
extern "C" {
    pub fn _wfopen(_FileName: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
extern "C" {
    pub fn _wfopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wfreopen(
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _OldStream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _wfreopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
extern "C" {
    pub fn _wfsopen(
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _ShFlag: ::std::os::raw::c_int,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _wperror(_ErrorMessage: *const wchar_t);
}
extern "C" {
    pub fn _wpopen(_Command: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
extern "C" {
    pub fn _wremove(_FileName: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wtempnam(_Directory: *const wchar_t, _FilePrefix: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wtmpnam_s(_Buffer: *mut wchar_t, _BufferCount: usize) -> errno_t;
}
extern "C" {
    pub fn _wtmpnam(_Buffer: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _fgetwc_nolock(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fputwc_nolock(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _getwc_nolock(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _putwc_nolock(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _ungetwc_nolock(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn __stdio_common_vfwprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsnwprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *const wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _itow_s(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _itow(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _ltow_s(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ltow(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _ultow_s(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ultow(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcstod(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn _wcstod_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> f64;
}
extern "C" {
    pub fn wcstol(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _wcstol_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn wcstoll(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wcstoll_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn wcstoul(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _wcstoul_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn wcstoull(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _wcstoull_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn wcstold(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn _wcstold_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> f64;
}
extern "C" {
    pub fn wcstof(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f32;
}
extern "C" {
    pub fn _wcstof_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> f32;
}
extern "C" {
    pub fn _wtof(_String: *const wchar_t) -> f64;
}
extern "C" {
    pub fn _wtof_l(_String: *const wchar_t, _Locale: _locale_t) -> f64;
}
extern "C" {
    pub fn _wtoi(_String: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wtoi_l(_String: *const wchar_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wtol(_String: *const wchar_t) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _wtol_l(_String: *const wchar_t, _Locale: _locale_t) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _wtoll(_String: *const wchar_t) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wtoll_l(_String: *const wchar_t, _Locale: _locale_t) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _i64tow_s(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _i64tow(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _ui64tow_s(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ui64tow(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wtoi64(_String: *const wchar_t) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wtoi64_l(_String: *const wchar_t, _Locale: _locale_t) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wcstoi64(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wcstoi64_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wcstoui64(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _wcstoui64_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _wfullpath(
        _Buffer: *mut wchar_t,
        _Path: *const wchar_t,
        _BufferCount: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wmakepath_s(
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Drive: *const wchar_t,
        _Dir: *const wchar_t,
        _Filename: *const wchar_t,
        _Ext: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wmakepath(
        _Buffer: *mut wchar_t,
        _Drive: *const wchar_t,
        _Dir: *const wchar_t,
        _Filename: *const wchar_t,
        _Ext: *const wchar_t,
    );
}
extern "C" {
    pub fn _wsplitpath(
        _FullPath: *const wchar_t,
        _Drive: *mut wchar_t,
        _Dir: *mut wchar_t,
        _Filename: *mut wchar_t,
        _Ext: *mut wchar_t,
    );
}
extern "C" {
    pub fn _wsplitpath_s(
        _FullPath: *const wchar_t,
        _Drive: *mut wchar_t,
        _DriveCount: usize,
        _Dir: *mut wchar_t,
        _DirCount: usize,
        _Filename: *mut wchar_t,
        _FilenameCount: usize,
        _Ext: *mut wchar_t,
        _ExtCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wdupenv_s(
        _Buffer: *mut *mut wchar_t,
        _BufferCount: *mut usize,
        _VarName: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wgetenv(_VarName: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wgetenv_s(
        _RequiredCount: *mut usize,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _VarName: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wputenv(_EnvString: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wputenv_s(_Name: *const wchar_t, _Value: *const wchar_t) -> errno_t;
}
extern "C" {
    pub fn _wsearchenv_s(
        _Filename: *const wchar_t,
        _VarName: *const wchar_t,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wsearchenv(
        _Filename: *const wchar_t,
        _VarName: *const wchar_t,
        _ResultPath: *mut wchar_t,
    );
}
extern "C" {
    pub fn wcscat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcscpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsncat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsncpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstok_s(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscat(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscmp(
        _String1: *const ::std::os::raw::c_ushort,
        _String2: *const ::std::os::raw::c_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcscpy(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcslen(_String: *const ::std::os::raw::c_ushort) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn wcsnlen(_Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn wcsncat(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncmp(
        _String1: *const ::std::os::raw::c_ushort,
        _String2: *const ::std::os::raw::c_ushort,
        _MaxCount: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsncpy(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcspbrk(_String: *const wchar_t, _Control: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcstok(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcserror(_ErrorNumber: ::std::os::raw::c_int) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcserror_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _ErrorNumber: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn __wcserror(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn __wcserror_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _ErrorMessage: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsicmp_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicmp(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicmp_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnset_s(
        _Destination: *mut wchar_t,
        _SizeInWords: usize,
        _Value: wchar_t,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsset_s(_Destination: *mut wchar_t, _SizeInWords: usize, _Value: wchar_t) -> errno_t;
}
extern "C" {
    pub fn _wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcslwr_s(_String: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
extern "C" {
    pub fn _wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcslwr_s_l(_String: *mut wchar_t, _SizeInWords: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
    pub fn _wcslwr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsupr_s(_String: *mut wchar_t, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsupr_s_l(_String: *mut wchar_t, _Size: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
    pub fn _wcsupr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsxfrm(_Destination: *mut wchar_t, _Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _wcsxfrm_l(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn wcscoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcscoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsicoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsncoll(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsncoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicoll(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsnicmp(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::std::mem::MaybeUninit<tm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(::std::mem::size_of::<tm>(), 36usize, "Size of tm");
    assert_eq!(::std::mem::align_of::<tm>(), 4usize, "Alignment of tm");
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        "Offset of field: tm::tm_sec"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        "Offset of field: tm::tm_min"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        "Offset of field: tm::tm_hour"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        "Offset of field: tm::tm_mday"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        "Offset of field: tm::tm_mon"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        "Offset of field: tm::tm_year"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        "Offset of field: tm::tm_wday"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        "Offset of field: tm::tm_yday"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        "Offset of field: tm::tm_isdst"
    );
}
extern "C" {
    pub fn _wasctime(_Tm: *const tm) -> *mut wchar_t;
}
extern "C" {
    pub fn _wasctime_s(_Buffer: *mut wchar_t, _SizeInWords: usize, _Tm: *const tm) -> errno_t;
}
extern "C" {
    pub fn wcsftime(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _Format: *const wchar_t,
        _Tm: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn _wcsftime_l(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _Format: *const wchar_t,
        _Tm: *const tm,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn _wctime32(_Time: *const __time32_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wctime32_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _Time: *const __time32_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wctime64(_Time: *const __time64_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wctime64_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _Time: *const __time64_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wstrdate_s(_Buffer: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
extern "C" {
    pub fn _wstrdate(_Buffer: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wstrtime_s(_Buffer: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
extern "C" {
    pub fn _wstrtime(_Buffer: *mut wchar_t) -> *mut wchar_t;
}
pub type _ino_t = ::std::os::raw::c_ushort;
pub type ino_t = _ino_t;
pub type _dev_t = ::std::os::raw::c_uint;
pub type dev_t = _dev_t;
pub type _off_t = ::std::os::raw::c_long;
pub type off_t = _off_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _stat32 {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: ::std::os::raw::c_ushort,
    pub st_nlink: ::std::os::raw::c_short,
    pub st_uid: ::std::os::raw::c_short,
    pub st_gid: ::std::os::raw::c_short,
    pub st_rdev: _dev_t,
    pub st_size: _off_t,
    pub st_atime: __time32_t,
    pub st_mtime: __time32_t,
    pub st_ctime: __time32_t,
}
#[test]
fn bindgen_test_layout__stat32() {
    const UNINIT: ::std::mem::MaybeUninit<_stat32> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(::std::mem::size_of::<_stat32>(), 36usize, "Size of _stat32");
    assert_eq!(
        ::std::mem::align_of::<_stat32>(),
        4usize,
        "Alignment of _stat32"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize },
        0usize,
        "Offset of field: _stat32::st_dev"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize },
        4usize,
        "Offset of field: _stat32::st_ino"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize },
        6usize,
        "Offset of field: _stat32::st_mode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize },
        8usize,
        "Offset of field: _stat32::st_nlink"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize },
        10usize,
        "Offset of field: _stat32::st_uid"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize },
        12usize,
        "Offset of field: _stat32::st_gid"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize },
        16usize,
        "Offset of field: _stat32::st_rdev"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        20usize,
        "Offset of field: _stat32::st_size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_atime) as usize - ptr as usize },
        24usize,
        "Offset of field: _stat32::st_atime"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mtime) as usize - ptr as usize },
        28usize,
        "Offset of field: _stat32::st_mtime"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ctime) as usize - ptr as usize },
        32usize,
        "Offset of field: _stat32::st_ctime"
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _stat32i64 {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: ::std::os::raw::c_ushort,
    pub st_nlink: ::std::os::raw::c_short,
    pub st_uid: ::std::os::raw::c_short,
    pub st_gid: ::std::os::raw::c_short,
    pub st_rdev: _dev_t,
    pub st_size: ::std::os::raw::c_longlong,
    pub st_atime: __time32_t,
    pub st_mtime: __time32_t,
    pub st_ctime: __time32_t,
}
#[test]
fn bindgen_test_layout__stat32i64() {
    const UNINIT: ::std::mem::MaybeUninit<_stat32i64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_stat32i64>(),
        48usize,
        "Size of _stat32i64"
    );
    assert_eq!(
        ::std::mem::align_of::<_stat32i64>(),
        8usize,
        "Alignment of _stat32i64"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize },
        0usize,
        "Offset of field: _stat32i64::st_dev"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize },
        4usize,
        "Offset of field: _stat32i64::st_ino"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize },
        6usize,
        "Offset of field: _stat32i64::st_mode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize },
        8usize,
        "Offset of field: _stat32i64::st_nlink"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize },
        10usize,
        "Offset of field: _stat32i64::st_uid"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize },
        12usize,
        "Offset of field: _stat32i64::st_gid"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize },
        16usize,
        "Offset of field: _stat32i64::st_rdev"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        24usize,
        "Offset of field: _stat32i64::st_size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_atime) as usize - ptr as usize },
        32usize,
        "Offset of field: _stat32i64::st_atime"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mtime) as usize - ptr as usize },
        36usize,
        "Offset of field: _stat32i64::st_mtime"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ctime) as usize - ptr as usize },
        40usize,
        "Offset of field: _stat32i64::st_ctime"
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _stat64i32 {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: ::std::os::raw::c_ushort,
    pub st_nlink: ::std::os::raw::c_short,
    pub st_uid: ::std::os::raw::c_short,
    pub st_gid: ::std::os::raw::c_short,
    pub st_rdev: _dev_t,
    pub st_size: _off_t,
    pub st_atime: __time64_t,
    pub st_mtime: __time64_t,
    pub st_ctime: __time64_t,
}
#[test]
fn bindgen_test_layout__stat64i32() {
    const UNINIT: ::std::mem::MaybeUninit<_stat64i32> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_stat64i32>(),
        48usize,
        "Size of _stat64i32"
    );
    assert_eq!(
        ::std::mem::align_of::<_stat64i32>(),
        8usize,
        "Alignment of _stat64i32"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize },
        0usize,
        "Offset of field: _stat64i32::st_dev"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize },
        4usize,
        "Offset of field: _stat64i32::st_ino"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize },
        6usize,
        "Offset of field: _stat64i32::st_mode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize },
        8usize,
        "Offset of field: _stat64i32::st_nlink"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize },
        10usize,
        "Offset of field: _stat64i32::st_uid"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize },
        12usize,
        "Offset of field: _stat64i32::st_gid"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize },
        16usize,
        "Offset of field: _stat64i32::st_rdev"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        20usize,
        "Offset of field: _stat64i32::st_size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_atime) as usize - ptr as usize },
        24usize,
        "Offset of field: _stat64i32::st_atime"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mtime) as usize - ptr as usize },
        32usize,
        "Offset of field: _stat64i32::st_mtime"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ctime) as usize - ptr as usize },
        40usize,
        "Offset of field: _stat64i32::st_ctime"
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _stat64 {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: ::std::os::raw::c_ushort,
    pub st_nlink: ::std::os::raw::c_short,
    pub st_uid: ::std::os::raw::c_short,
    pub st_gid: ::std::os::raw::c_short,
    pub st_rdev: _dev_t,
    pub st_size: ::std::os::raw::c_longlong,
    pub st_atime: __time64_t,
    pub st_mtime: __time64_t,
    pub st_ctime: __time64_t,
}
#[test]
fn bindgen_test_layout__stat64() {
    const UNINIT: ::std::mem::MaybeUninit<_stat64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(::std::mem::size_of::<_stat64>(), 56usize, "Size of _stat64");
    assert_eq!(
        ::std::mem::align_of::<_stat64>(),
        8usize,
        "Alignment of _stat64"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize },
        0usize,
        "Offset of field: _stat64::st_dev"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize },
        4usize,
        "Offset of field: _stat64::st_ino"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize },
        6usize,
        "Offset of field: _stat64::st_mode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize },
        8usize,
        "Offset of field: _stat64::st_nlink"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize },
        10usize,
        "Offset of field: _stat64::st_uid"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize },
        12usize,
        "Offset of field: _stat64::st_gid"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize },
        16usize,
        "Offset of field: _stat64::st_rdev"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        24usize,
        "Offset of field: _stat64::st_size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_atime) as usize - ptr as usize },
        32usize,
        "Offset of field: _stat64::st_atime"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mtime) as usize - ptr as usize },
        40usize,
        "Offset of field: _stat64::st_mtime"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ctime) as usize - ptr as usize },
        48usize,
        "Offset of field: _stat64::st_ctime"
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct stat {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: ::std::os::raw::c_ushort,
    pub st_nlink: ::std::os::raw::c_short,
    pub st_uid: ::std::os::raw::c_short,
    pub st_gid: ::std::os::raw::c_short,
    pub st_rdev: _dev_t,
    pub st_size: _off_t,
    pub st_atime: time_t,
    pub st_mtime: time_t,
    pub st_ctime: time_t,
}
#[test]
fn bindgen_test_layout_stat() {
    const UNINIT: ::std::mem::MaybeUninit<stat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(::std::mem::size_of::<stat>(), 48usize, "Size of stat");
    assert_eq!(::std::mem::align_of::<stat>(), 8usize, "Alignment of stat");
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize },
        0usize,
        "Offset of field: stat::st_dev"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize },
        4usize,
        "Offset of field: stat::st_ino"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize },
        6usize,
        "Offset of field: stat::st_mode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize },
        8usize,
        "Offset of field: stat::st_nlink"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize },
        10usize,
        "Offset of field: stat::st_uid"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize },
        12usize,
        "Offset of field: stat::st_gid"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize },
        16usize,
        "Offset of field: stat::st_rdev"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        20usize,
        "Offset of field: stat::st_size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_atime) as usize - ptr as usize },
        24usize,
        "Offset of field: stat::st_atime"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_mtime) as usize - ptr as usize },
        32usize,
        "Offset of field: stat::st_mtime"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).st_ctime) as usize - ptr as usize },
        40usize,
        "Offset of field: stat::st_ctime"
    );
}
extern "C" {
    pub fn _fstat32(
        _FileHandle: ::std::os::raw::c_int,
        _Stat: *mut _stat32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fstat32i64(
        _FileHandle: ::std::os::raw::c_int,
        _Stat: *mut _stat32i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fstat64i32(
        _FileHandle: ::std::os::raw::c_int,
        _Stat: *mut _stat64i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fstat64(
        _FileHandle: ::std::os::raw::c_int,
        _Stat: *mut _stat64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stat32(
        _FileName: *const ::std::os::raw::c_char,
        _Stat: *mut _stat32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stat32i64(
        _FileName: *const ::std::os::raw::c_char,
        _Stat: *mut _stat32i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stat64i32(
        _FileName: *const ::std::os::raw::c_char,
        _Stat: *mut _stat64i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stat64(
        _FileName: *const ::std::os::raw::c_char,
        _Stat: *mut _stat64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wstat32(_FileName: *const wchar_t, _Stat: *mut _stat32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wstat32i64(_FileName: *const wchar_t, _Stat: *mut _stat32i64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wstat64i32(_FileName: *const wchar_t, _Stat: *mut _stat64i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wstat64(_FileName: *const wchar_t, _Stat: *mut _stat64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _BitScanForward(
        _Index: *mut ::std::os::raw::c_ulong,
        _Mask: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _BitScanReverse(
        _Index: *mut ::std::os::raw::c_ulong,
        _Mask: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _ReadWriteBarrier();
}
extern "C" {
    pub fn _umul128(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_ulonglong,
        arg3: *mut ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn __shiftleft128(
        _LowPart: ::std::os::raw::c_ulonglong,
        _HighPart: ::std::os::raw::c_ulonglong,
        _Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn __shiftright128(
        _LowPart: ::std::os::raw::c_ulonglong,
        _HighPart: ::std::os::raw::c_ulonglong,
        _Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _mm_pause();
}
extern "C" {
    pub fn _InterlockedCompareExchange128(
        _Destination: *mut ::std::os::raw::c_longlong,
        _ExchangeHigh: ::std::os::raw::c_longlong,
        _ExchangeLow: ::std::os::raw::c_longlong,
        _ComparandResult: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _BitScanForward64(
        _Index: *mut ::std::os::raw::c_ulong,
        _Mask: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _BitScanReverse64(
        _Index: *mut ::std::os::raw::c_ulong,
        _Mask: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _InterlockedDecrement64(
        _Addend: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedExchange64(
        _Target: *mut ::std::os::raw::c_longlong,
        _Value: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedExchangeAdd64(
        _Addend: *mut ::std::os::raw::c_longlong,
        _Value: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedExchangeSub64(
        _Subend: *mut ::std::os::raw::c_longlong,
        _Value: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedIncrement64(
        _Addend: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedOr64(
        _Value: *mut ::std::os::raw::c_longlong,
        _Mask: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedXor64(
        _Value: *mut ::std::os::raw::c_longlong,
        _Mask: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedAnd64(
        _Value: *mut ::std::os::raw::c_longlong,
        _Mask: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __uintr_frame {
    pub rip: ::std::os::raw::c_ulonglong,
    pub rflags: ::std::os::raw::c_ulonglong,
    pub rsp: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout___uintr_frame() {
    const UNINIT: ::std::mem::MaybeUninit<__uintr_frame> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__uintr_frame>(),
        24usize,
        "Size of __uintr_frame"
    );
    assert_eq!(
        ::std::mem::align_of::<__uintr_frame>(),
        8usize,
        "Alignment of __uintr_frame"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rip) as usize - ptr as usize },
        0usize,
        "Offset of field: __uintr_frame::rip"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rflags) as usize - ptr as usize },
        8usize,
        "Offset of field: __uintr_frame::rflags"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rsp) as usize - ptr as usize },
        16usize,
        "Offset of field: __uintr_frame::rsp"
    );
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _CMPCCX_ENUM {
    _CMPCCX_O = 0,
    _CMPCCX_NO = 1,
    _CMPCCX_B = 2,
    _CMPCCX_NB = 3,
    _CMPCCX_Z = 4,
    _CMPCCX_NZ = 5,
    _CMPCCX_BE = 6,
    _CMPCCX_NBE = 7,
    _CMPCCX_S = 8,
    _CMPCCX_NS = 9,
    _CMPCCX_P = 10,
    _CMPCCX_NP = 11,
    _CMPCCX_L = 12,
    _CMPCCX_NL = 13,
    _CMPCCX_LE = 14,
    _CMPCCX_NLE = 15,
}
pub type __m64 = [::std::os::raw::c_longlong; 1usize];
pub type __v1di = [::std::os::raw::c_longlong; 1usize];
pub type __v2si = [::std::os::raw::c_int; 2usize];
pub type __v4hi = [::std::os::raw::c_short; 4usize];
pub type __v8qi = [::std::os::raw::c_char; 8usize];
pub type __v4si = [::std::os::raw::c_int; 4usize];
pub type __v4sf = [f32; 4usize];
pub type __m128 = [f32; 4usize];
pub type __m128_u = [f32; 4usize];
pub type __v4su = [::std::os::raw::c_uint; 4usize];
extern "C" {
    pub fn _calloc_base(_Count: usize, _Size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        _Count: ::std::os::raw::c_ulonglong,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _callnewh(_Size: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _expand(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _free_base(_Block: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn free(_Block: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _malloc_base(_Size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn malloc(_Size: ::std::os::raw::c_ulonglong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _msize_base(_Block: *mut ::std::os::raw::c_void) -> usize;
}
extern "C" {
    pub fn _msize(_Block: *mut ::std::os::raw::c_void) -> usize;
}
extern "C" {
    pub fn _realloc_base(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        _Block: *mut ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _recalloc_base(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _recalloc(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_free(_Block: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _aligned_malloc(_Size: usize, _Alignment: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_offset_malloc(
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_msize(
        _Block: *mut ::std::os::raw::c_void,
        _Alignment: usize,
        _Offset: usize,
    ) -> usize;
}
extern "C" {
    pub fn _aligned_offset_realloc(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_offset_recalloc(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_realloc(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
        _Alignment: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_recalloc(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
        _Alignment: usize,
    ) -> *mut ::std::os::raw::c_void;
}
pub type _CoreCrtSecureSearchSortCompareFunction = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type _CoreCrtNonSecureSearchSortCompareFunction = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch_s(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: rsize_t,
        _SizeOfElements: rsize_t,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort_s(
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: rsize_t,
        _SizeOfElements: rsize_t,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn bsearch(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: usize,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: usize,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    );
}
extern "C" {
    pub fn _lfind_s(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _lfind(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: ::std::os::raw::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _lsearch_s(
        _Key: *const ::std::os::raw::c_void,
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _lsearch(
        _Key: *const ::std::os::raw::c_void,
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: ::std::os::raw::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn lfind(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: ::std::os::raw::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn lsearch(
        _Key: *const ::std::os::raw::c_void,
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: ::std::os::raw::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _swab(
        _Buf1: *mut ::std::os::raw::c_char,
        _Buf2: *mut ::std::os::raw::c_char,
        _SizeInBytes: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn exit(_Code: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn _exit(_Code: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn _Exit(_Code: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(_Code: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn _set_abort_behavior(
        _Flags: ::std::os::raw::c_uint,
        _Mask: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
pub type _onexit_t = ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
extern "C" {
    pub fn atexit(arg1: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _onexit(_Func: _onexit_t) -> _onexit_t;
}
extern "C" {
    pub fn at_quick_exit(
        arg1: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
pub type _purecall_handler = ::std::option::Option<unsafe extern "C" fn()>;
pub type _invalid_parameter_handler = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const wchar_t,
        arg2: *const wchar_t,
        arg3: *const wchar_t,
        arg4: ::std::os::raw::c_uint,
        arg5: usize,
    ),
>;
extern "C" {
    pub fn _set_purecall_handler(_Handler: _purecall_handler) -> _purecall_handler;
}
extern "C" {
    pub fn _get_purecall_handler() -> _purecall_handler;
}
extern "C" {
    pub fn _set_invalid_parameter_handler(
        _Handler: _invalid_parameter_handler,
    ) -> _invalid_parameter_handler;
}
extern "C" {
    pub fn _get_invalid_parameter_handler() -> _invalid_parameter_handler;
}
extern "C" {
    pub fn _set_thread_local_invalid_parameter_handler(
        _Handler: _invalid_parameter_handler,
    ) -> _invalid_parameter_handler;
}
extern "C" {
    pub fn _get_thread_local_invalid_parameter_handler() -> _invalid_parameter_handler;
}
extern "C" {
    pub fn _set_error_mode(_Mode: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __sys_errlist() -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __sys_nerr() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(_ErrMsg: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn __p__pgmptr() -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __p__wpgmptr() -> *mut *mut wchar_t;
}
extern "C" {
    pub fn __p__fmode() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn _get_pgmptr(_Value: *mut *mut ::std::os::raw::c_char) -> errno_t;
}
extern "C" {
    pub fn _get_wpgmptr(_Value: *mut *mut wchar_t) -> errno_t;
}
extern "C" {
    pub fn _set_fmode(_Mode: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_fmode(_PMode: *mut ::std::os::raw::c_int) -> errno_t;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__div_t() {
    const UNINIT: ::std::mem::MaybeUninit<_div_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(::std::mem::size_of::<_div_t>(), 8usize, "Size of _div_t");
    assert_eq!(
        ::std::mem::align_of::<_div_t>(),
        4usize,
        "Alignment of _div_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        "Offset of field: _div_t::quot"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        "Offset of field: _div_t::rem"
    );
}
pub type div_t = _div_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout__ldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<_ldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(::std::mem::size_of::<_ldiv_t>(), 8usize, "Size of _ldiv_t");
    assert_eq!(
        ::std::mem::align_of::<_ldiv_t>(),
        4usize,
        "Alignment of _ldiv_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        "Offset of field: _ldiv_t::quot"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        "Offset of field: _ldiv_t::rem"
    );
}
pub type ldiv_t = _ldiv_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout__lldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<_lldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_lldiv_t>(),
        16usize,
        "Size of _lldiv_t"
    );
    assert_eq!(
        ::std::mem::align_of::<_lldiv_t>(),
        8usize,
        "Alignment of _lldiv_t"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        "Offset of field: _lldiv_t::quot"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        "Offset of field: _lldiv_t::rem"
    );
}
pub type lldiv_t = _lldiv_t;
extern "C" {
    pub fn abs(_Number: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(_Number: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(_Number: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _abs64(_Number: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _byteswap_ushort(_Number: ::std::os::raw::c_ushort) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn _byteswap_ulong(_Number: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _byteswap_uint64(_Number: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn div(_Numerator: ::std::os::raw::c_int, _Denominator: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(_Numerator: ::std::os::raw::c_long, _Denominator: ::std::os::raw::c_long)
        -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        _Numerator: ::std::os::raw::c_longlong,
        _Denominator: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn _rotl(
        _Value: ::std::os::raw::c_uint,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _lrotl(
        _Value: ::std::os::raw::c_ulong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _rotl64(
        _Value: ::std::os::raw::c_ulonglong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _rotr(
        _Value: ::std::os::raw::c_uint,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _lrotr(
        _Value: ::std::os::raw::c_ulong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _rotr64(
        _Value: ::std::os::raw::c_ulonglong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn srand(_Seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _LDOUBLE {
    pub ld: [::std::os::raw::c_uchar; 10usize],
}
#[test]
fn bindgen_test_layout__LDOUBLE() {
    const UNINIT: ::std::mem::MaybeUninit<_LDOUBLE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_LDOUBLE>(),
        10usize,
        "Size of _LDOUBLE"
    );
    assert_eq!(
        ::std::mem::align_of::<_LDOUBLE>(),
        1usize,
        "Alignment of _LDOUBLE"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ld) as usize - ptr as usize },
        0usize,
        "Offset of field: _LDOUBLE::ld"
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CRT_DOUBLE {
    pub x: f64,
}
#[test]
fn bindgen_test_layout__CRT_DOUBLE() {
    const UNINIT: ::std::mem::MaybeUninit<_CRT_DOUBLE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_CRT_DOUBLE>(),
        8usize,
        "Size of _CRT_DOUBLE"
    );
    assert_eq!(
        ::std::mem::align_of::<_CRT_DOUBLE>(),
        8usize,
        "Alignment of _CRT_DOUBLE"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        "Offset of field: _CRT_DOUBLE::x"
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _CRT_FLOAT {
    pub f: f32,
}
#[test]
fn bindgen_test_layout__CRT_FLOAT() {
    const UNINIT: ::std::mem::MaybeUninit<_CRT_FLOAT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_CRT_FLOAT>(),
        4usize,
        "Size of _CRT_FLOAT"
    );
    assert_eq!(
        ::std::mem::align_of::<_CRT_FLOAT>(),
        4usize,
        "Alignment of _CRT_FLOAT"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f) as usize - ptr as usize },
        0usize,
        "Offset of field: _CRT_FLOAT::f"
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _LONGDOUBLE {
    pub x: f64,
}
#[test]
fn bindgen_test_layout__LONGDOUBLE() {
    const UNINIT: ::std::mem::MaybeUninit<_LONGDOUBLE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_LONGDOUBLE>(),
        8usize,
        "Size of _LONGDOUBLE"
    );
    assert_eq!(
        ::std::mem::align_of::<_LONGDOUBLE>(),
        8usize,
        "Alignment of _LONGDOUBLE"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        "Offset of field: _LONGDOUBLE::x"
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _LDBL12 {
    pub ld12: [::std::os::raw::c_uchar; 12usize],
}
#[test]
fn bindgen_test_layout__LDBL12() {
    const UNINIT: ::std::mem::MaybeUninit<_LDBL12> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(::std::mem::size_of::<_LDBL12>(), 12usize, "Size of _LDBL12");
    assert_eq!(
        ::std::mem::align_of::<_LDBL12>(),
        1usize,
        "Alignment of _LDBL12"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ld12) as usize - ptr as usize },
        0usize,
        "Offset of field: _LDBL12::ld12"
    );
}
extern "C" {
    pub fn atof(_String: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(_String: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(_String: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(_String: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _atoi64(_String: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _atof_l(_String: *const ::std::os::raw::c_char, _Locale: _locale_t) -> f64;
}
extern "C" {
    pub fn _atoi_l(
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _atol_l(
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _atoll_l(
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _atoi64_l(
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _atoflt(
        _Result: *mut _CRT_FLOAT,
        _String: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _atodbl(
        _Result: *mut _CRT_DOUBLE,
        _String: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _atoldbl(
        _Result: *mut _LDOUBLE,
        _String: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _atoflt_l(
        _Result: *mut _CRT_FLOAT,
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _atodbl_l(
        _Result: *mut _CRT_DOUBLE,
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _atoldbl_l(
        _Result: *mut _LDOUBLE,
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strtof(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn _strtof_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> f32;
}
extern "C" {
    pub fn strtod(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn _strtod_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> f64;
}
extern "C" {
    pub fn strtold(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn _strtold_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> f64;
}
extern "C" {
    pub fn strtol(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _strtol_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoll(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _strtoll_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoul(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _strtoul_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoull(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _strtoull_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _strtoi64(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _strtoi64_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _strtoui64(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _strtoui64_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _itoa_s(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _itoa(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _ltoa_s(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ltoa(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _ultoa_s(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ultoa(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _i64toa_s(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _i64toa(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _ui64toa_s(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ui64toa(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _ecvt_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ecvt(
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _fcvt_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Value: f64,
        _FractionalDigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _fcvt(
        _Value: f64,
        _FractionalDigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _gcvt_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _gcvt(
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _Buffer: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ___mb_cur_max_func() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ___mb_cur_max_l_func(_Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(_Ch: *const ::std::os::raw::c_char, _MaxCount: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mblen_l(
        _Ch: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mbstrlen(_String: *const ::std::os::raw::c_char) -> usize;
}
extern "C" {
    pub fn _mbstrlen_l(_String: *const ::std::os::raw::c_char, _Locale: _locale_t) -> usize;
}
extern "C" {
    pub fn _mbstrnlen(_String: *const ::std::os::raw::c_char, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _mbstrnlen_l(
        _String: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn mbtowc(
        _DstCh: *mut wchar_t,
        _SrcCh: *const ::std::os::raw::c_char,
        _SrcSizeInBytes: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mbtowc_l(
        _DstCh: *mut wchar_t,
        _SrcCh: *const ::std::os::raw::c_char,
        _SrcSizeInBytes: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs_s(
        _PtNumOfCharConverted: *mut usize,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _SrcBuf: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn mbstowcs(
        _Dest: *mut wchar_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> usize;
}
extern "C" {
    pub fn _mbstowcs_s_l(
        _PtNumOfCharConverted: *mut usize,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _SrcBuf: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _mbstowcs_l(
        _Dest: *mut wchar_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn wctomb(_MbCh: *mut ::std::os::raw::c_char, _WCh: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wctomb_l(
        _MbCh: *mut ::std::os::raw::c_char,
        _WCh: wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb_s(
        _SizeConverted: *mut ::std::os::raw::c_int,
        _MbCh: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _WCh: wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wctomb_s_l(
        _SizeConverted: *mut ::std::os::raw::c_int,
        _MbCh: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _WCh: wchar_t,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstombs_s(
        _PtNumOfCharConverted: *mut usize,
        _Dst: *mut ::std::os::raw::c_char,
        _DstSizeInBytes: usize,
        _Src: *const wchar_t,
        _MaxCountInBytes: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstombs(
        _Dest: *mut ::std::os::raw::c_char,
        _Source: *const wchar_t,
        _MaxCount: usize,
    ) -> usize;
}
extern "C" {
    pub fn _wcstombs_s_l(
        _PtNumOfCharConverted: *mut usize,
        _Dst: *mut ::std::os::raw::c_char,
        _DstSizeInBytes: usize,
        _Src: *const wchar_t,
        _MaxCountInBytes: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcstombs_l(
        _Dest: *mut ::std::os::raw::c_char,
        _Source: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn _fullpath(
        _Buffer: *mut ::std::os::raw::c_char,
        _Path: *const ::std::os::raw::c_char,
        _BufferCount: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _makepath_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Drive: *const ::std::os::raw::c_char,
        _Dir: *const ::std::os::raw::c_char,
        _Filename: *const ::std::os::raw::c_char,
        _Ext: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn _makepath(
        _Buffer: *mut ::std::os::raw::c_char,
        _Drive: *const ::std::os::raw::c_char,
        _Dir: *const ::std::os::raw::c_char,
        _Filename: *const ::std::os::raw::c_char,
        _Ext: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn _splitpath(
        _FullPath: *const ::std::os::raw::c_char,
        _Drive: *mut ::std::os::raw::c_char,
        _Dir: *mut ::std::os::raw::c_char,
        _Filename: *mut ::std::os::raw::c_char,
        _Ext: *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn _splitpath_s(
        _FullPath: *const ::std::os::raw::c_char,
        _Drive: *mut ::std::os::raw::c_char,
        _DriveCount: usize,
        _Dir: *mut ::std::os::raw::c_char,
        _DirCount: usize,
        _Filename: *mut ::std::os::raw::c_char,
        _FilenameCount: usize,
        _Ext: *mut ::std::os::raw::c_char,
        _ExtCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn getenv_s(
        _RequiredCount: *mut usize,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: rsize_t,
        _VarName: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn __p___argc() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn __p___argv() -> *mut *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __p___wargv() -> *mut *mut *mut wchar_t;
}
extern "C" {
    pub fn __p__environ() -> *mut *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __p__wenviron() -> *mut *mut *mut wchar_t;
}
extern "C" {
    pub fn getenv(_VarName: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _dupenv_s(
        _Buffer: *mut *mut ::std::os::raw::c_char,
        _BufferCount: *mut usize,
        _VarName: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn system(_Command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _putenv(_EnvString: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _putenv_s(
        _Name: *const ::std::os::raw::c_char,
        _Value: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn _searchenv_s(
        _Filename: *const ::std::os::raw::c_char,
        _VarName: *const ::std::os::raw::c_char,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _searchenv(
        _Filename: *const ::std::os::raw::c_char,
        _VarName: *const ::std::os::raw::c_char,
        _Buffer: *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn _seterrormode(_Mode: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _beep(_Frequency: ::std::os::raw::c_uint, _Duration: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn _sleep(_Duration: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn ecvt(
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        _Value: f64,
        _FractionalDigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _DstBuf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn itoa(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ltoa(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn swab(
        _Buf1: *mut ::std::os::raw::c_char,
        _Buf2: *mut ::std::os::raw::c_char,
        _SizeInBytes: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn ultoa(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(_EnvString: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn onexit(_Func: _onexit_t) -> _onexit_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _heapinfo {
    pub _pentry: *mut ::std::os::raw::c_int,
    pub _size: usize,
    pub _useflag: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__heapinfo() {
    const UNINIT: ::std::mem::MaybeUninit<_heapinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_heapinfo>(),
        24usize,
        "Size of _heapinfo"
    );
    assert_eq!(
        ::std::mem::align_of::<_heapinfo>(),
        8usize,
        "Alignment of _heapinfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pentry) as usize - ptr as usize },
        0usize,
        "Offset of field: _heapinfo::_pentry"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._size) as usize - ptr as usize },
        8usize,
        "Offset of field: _heapinfo::_size"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._useflag) as usize - ptr as usize },
        16usize,
        "Offset of field: _heapinfo::_useflag"
    );
}
impl Default for _heapinfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type _HEAPINFO = _heapinfo;
extern "C" {
    pub fn _alloca(_Size: ::std::os::raw::c_ulonglong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _get_heap_handle() -> isize;
}
extern "C" {
    pub fn _heapmin() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _heapwalk(_EntryInfo: *mut _HEAPINFO) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _heapchk() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _resetstkoflw() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_sfence();
}
extern "C" {
    pub fn _mm_getcsr() -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _mm_setcsr(__i: ::std::os::raw::c_uint);
}
pub type __m128d = [f64; 2usize];
pub type __m128i = [::std::os::raw::c_longlong; 2usize];
pub type __m128d_u = [f64; 2usize];
pub type __m128i_u = [::std::os::raw::c_longlong; 2usize];
pub type __v2df = [f64; 2usize];
pub type __v2di = [::std::os::raw::c_longlong; 2usize];
pub type __v8hi = [::std::os::raw::c_short; 8usize];
pub type __v16qi = [::std::os::raw::c_char; 16usize];
pub type __v2du = [::std::os::raw::c_ulonglong; 2usize];
pub type __v8hu = [::std::os::raw::c_ushort; 8usize];
pub type __v16qu = [::std::os::raw::c_uchar; 16usize];
pub type __v16qs = [::std::os::raw::c_schar; 16usize];
pub type __v8hf = [__BindgenFloat16; 8usize];
pub type __m128h = [__BindgenFloat16; 8usize];
pub type __m128h_u = [__BindgenFloat16; 8usize];
pub type __v8bf = u128;
pub type __m128bh = u128;
extern "C" {
    pub fn _mm_clflush(__p: *const ::std::os::raw::c_void);
}
extern "C" {
    pub fn _mm_lfence();
}
extern "C" {
    pub fn _mm_mfence();
}
pub type __v4df = [f64; 4usize];
pub type __v8sf = [f32; 8usize];
pub type __v4di = [::std::os::raw::c_longlong; 4usize];
pub type __v8si = [::std::os::raw::c_int; 8usize];
pub type __v16hi = [::std::os::raw::c_short; 16usize];
pub type __v32qi = [::std::os::raw::c_char; 32usize];
pub type __v4du = [::std::os::raw::c_ulonglong; 4usize];
pub type __v8su = [::std::os::raw::c_uint; 8usize];
pub type __v16hu = [::std::os::raw::c_ushort; 16usize];
pub type __v32qu = [::std::os::raw::c_uchar; 32usize];
pub type __v32qs = [::std::os::raw::c_schar; 32usize];
pub type __m256 = [f32; 8usize];
pub type __m256d = [f64; 4usize];
pub type __m256i = [::std::os::raw::c_longlong; 4usize];
pub type __m256_u = [f32; 8usize];
pub type __m256d_u = [f64; 4usize];
pub type __m256i_u = [::std::os::raw::c_longlong; 4usize];
pub type __v16hf = [__BindgenFloat16; 16usize];
pub type __m256h = [__BindgenFloat16; 16usize];
pub type __m256h_u = [__BindgenFloat16; 16usize];
pub type __v16bf = __BindgenOpaqueArray<u8, 32usize>;
pub type __m256bh = __BindgenOpaqueArray<u8, 32usize>;
pub type __v64qi = [::std::os::raw::c_char; 64usize];
pub type __v32hi = [::std::os::raw::c_short; 32usize];
pub type __v8df = [f64; 8usize];
pub type __v16sf = [f32; 16usize];
pub type __v8di = [::std::os::raw::c_longlong; 8usize];
pub type __v16si = [::std::os::raw::c_int; 16usize];
pub type __v64qu = [::std::os::raw::c_uchar; 64usize];
pub type __v32hu = [::std::os::raw::c_ushort; 32usize];
pub type __v8du = [::std::os::raw::c_ulonglong; 8usize];
pub type __v16su = [::std::os::raw::c_uint; 16usize];
pub type __v64qs = [::std::os::raw::c_schar; 64usize];
pub type __m512 = [f32; 16usize];
pub type __m512d = [f64; 8usize];
pub type __m512i = [::std::os::raw::c_longlong; 8usize];
pub type __m512_u = [f32; 16usize];
pub type __m512d_u = [f64; 8usize];
pub type __m512i_u = [::std::os::raw::c_longlong; 8usize];
pub type __mmask8 = ::std::os::raw::c_uchar;
pub type __mmask16 = ::std::os::raw::c_ushort;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _MM_CMPINT_ENUM {
    _MM_CMPINT_EQ = 0,
    _MM_CMPINT_LT = 1,
    _MM_CMPINT_LE = 2,
    _MM_CMPINT_UNUSED = 3,
    _MM_CMPINT_NE = 4,
    _MM_CMPINT_NLT = 5,
    _MM_CMPINT_NLE = 6,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _MM_PERM_ENUM {
    _MM_PERM_AAAA = 0,
    _MM_PERM_AAAB = 1,
    _MM_PERM_AAAC = 2,
    _MM_PERM_AAAD = 3,
    _MM_PERM_AABA = 4,
    _MM_PERM_AABB = 5,
    _MM_PERM_AABC = 6,
    _MM_PERM_AABD = 7,
    _MM_PERM_AACA = 8,
    _MM_PERM_AACB = 9,
    _MM_PERM_AACC = 10,
    _MM_PERM_AACD = 11,
    _MM_PERM_AADA = 12,
    _MM_PERM_AADB = 13,
    _MM_PERM_AADC = 14,
    _MM_PERM_AADD = 15,
    _MM_PERM_ABAA = 16,
    _MM_PERM_ABAB = 17,
    _MM_PERM_ABAC = 18,
    _MM_PERM_ABAD = 19,
    _MM_PERM_ABBA = 20,
    _MM_PERM_ABBB = 21,
    _MM_PERM_ABBC = 22,
    _MM_PERM_ABBD = 23,
    _MM_PERM_ABCA = 24,
    _MM_PERM_ABCB = 25,
    _MM_PERM_ABCC = 26,
    _MM_PERM_ABCD = 27,
    _MM_PERM_ABDA = 28,
    _MM_PERM_ABDB = 29,
    _MM_PERM_ABDC = 30,
    _MM_PERM_ABDD = 31,
    _MM_PERM_ACAA = 32,
    _MM_PERM_ACAB = 33,
    _MM_PERM_ACAC = 34,
    _MM_PERM_ACAD = 35,
    _MM_PERM_ACBA = 36,
    _MM_PERM_ACBB = 37,
    _MM_PERM_ACBC = 38,
    _MM_PERM_ACBD = 39,
    _MM_PERM_ACCA = 40,
    _MM_PERM_ACCB = 41,
    _MM_PERM_ACCC = 42,
    _MM_PERM_ACCD = 43,
    _MM_PERM_ACDA = 44,
    _MM_PERM_ACDB = 45,
    _MM_PERM_ACDC = 46,
    _MM_PERM_ACDD = 47,
    _MM_PERM_ADAA = 48,
    _MM_PERM_ADAB = 49,
    _MM_PERM_ADAC = 50,
    _MM_PERM_ADAD = 51,
    _MM_PERM_ADBA = 52,
    _MM_PERM_ADBB = 53,
    _MM_PERM_ADBC = 54,
    _MM_PERM_ADBD = 55,
    _MM_PERM_ADCA = 56,
    _MM_PERM_ADCB = 57,
    _MM_PERM_ADCC = 58,
    _MM_PERM_ADCD = 59,
    _MM_PERM_ADDA = 60,
    _MM_PERM_ADDB = 61,
    _MM_PERM_ADDC = 62,
    _MM_PERM_ADDD = 63,
    _MM_PERM_BAAA = 64,
    _MM_PERM_BAAB = 65,
    _MM_PERM_BAAC = 66,
    _MM_PERM_BAAD = 67,
    _MM_PERM_BABA = 68,
    _MM_PERM_BABB = 69,
    _MM_PERM_BABC = 70,
    _MM_PERM_BABD = 71,
    _MM_PERM_BACA = 72,
    _MM_PERM_BACB = 73,
    _MM_PERM_BACC = 74,
    _MM_PERM_BACD = 75,
    _MM_PERM_BADA = 76,
    _MM_PERM_BADB = 77,
    _MM_PERM_BADC = 78,
    _MM_PERM_BADD = 79,
    _MM_PERM_BBAA = 80,
    _MM_PERM_BBAB = 81,
    _MM_PERM_BBAC = 82,
    _MM_PERM_BBAD = 83,
    _MM_PERM_BBBA = 84,
    _MM_PERM_BBBB = 85,
    _MM_PERM_BBBC = 86,
    _MM_PERM_BBBD = 87,
    _MM_PERM_BBCA = 88,
    _MM_PERM_BBCB = 89,
    _MM_PERM_BBCC = 90,
    _MM_PERM_BBCD = 91,
    _MM_PERM_BBDA = 92,
    _MM_PERM_BBDB = 93,
    _MM_PERM_BBDC = 94,
    _MM_PERM_BBDD = 95,
    _MM_PERM_BCAA = 96,
    _MM_PERM_BCAB = 97,
    _MM_PERM_BCAC = 98,
    _MM_PERM_BCAD = 99,
    _MM_PERM_BCBA = 100,
    _MM_PERM_BCBB = 101,
    _MM_PERM_BCBC = 102,
    _MM_PERM_BCBD = 103,
    _MM_PERM_BCCA = 104,
    _MM_PERM_BCCB = 105,
    _MM_PERM_BCCC = 106,
    _MM_PERM_BCCD = 107,
    _MM_PERM_BCDA = 108,
    _MM_PERM_BCDB = 109,
    _MM_PERM_BCDC = 110,
    _MM_PERM_BCDD = 111,
    _MM_PERM_BDAA = 112,
    _MM_PERM_BDAB = 113,
    _MM_PERM_BDAC = 114,
    _MM_PERM_BDAD = 115,
    _MM_PERM_BDBA = 116,
    _MM_PERM_BDBB = 117,
    _MM_PERM_BDBC = 118,
    _MM_PERM_BDBD = 119,
    _MM_PERM_BDCA = 120,
    _MM_PERM_BDCB = 121,
    _MM_PERM_BDCC = 122,
    _MM_PERM_BDCD = 123,
    _MM_PERM_BDDA = 124,
    _MM_PERM_BDDB = 125,
    _MM_PERM_BDDC = 126,
    _MM_PERM_BDDD = 127,
    _MM_PERM_CAAA = 128,
    _MM_PERM_CAAB = 129,
    _MM_PERM_CAAC = 130,
    _MM_PERM_CAAD = 131,
    _MM_PERM_CABA = 132,
    _MM_PERM_CABB = 133,
    _MM_PERM_CABC = 134,
    _MM_PERM_CABD = 135,
    _MM_PERM_CACA = 136,
    _MM_PERM_CACB = 137,
    _MM_PERM_CACC = 138,
    _MM_PERM_CACD = 139,
    _MM_PERM_CADA = 140,
    _MM_PERM_CADB = 141,
    _MM_PERM_CADC = 142,
    _MM_PERM_CADD = 143,
    _MM_PERM_CBAA = 144,
    _MM_PERM_CBAB = 145,
    _MM_PERM_CBAC = 146,
    _MM_PERM_CBAD = 147,
    _MM_PERM_CBBA = 148,
    _MM_PERM_CBBB = 149,
    _MM_PERM_CBBC = 150,
    _MM_PERM_CBBD = 151,
    _MM_PERM_CBCA = 152,
    _MM_PERM_CBCB = 153,
    _MM_PERM_CBCC = 154,
    _MM_PERM_CBCD = 155,
    _MM_PERM_CBDA = 156,
    _MM_PERM_CBDB = 157,
    _MM_PERM_CBDC = 158,
    _MM_PERM_CBDD = 159,
    _MM_PERM_CCAA = 160,
    _MM_PERM_CCAB = 161,
    _MM_PERM_CCAC = 162,
    _MM_PERM_CCAD = 163,
    _MM_PERM_CCBA = 164,
    _MM_PERM_CCBB = 165,
    _MM_PERM_CCBC = 166,
    _MM_PERM_CCBD = 167,
    _MM_PERM_CCCA = 168,
    _MM_PERM_CCCB = 169,
    _MM_PERM_CCCC = 170,
    _MM_PERM_CCCD = 171,
    _MM_PERM_CCDA = 172,
    _MM_PERM_CCDB = 173,
    _MM_PERM_CCDC = 174,
    _MM_PERM_CCDD = 175,
    _MM_PERM_CDAA = 176,
    _MM_PERM_CDAB = 177,
    _MM_PERM_CDAC = 178,
    _MM_PERM_CDAD = 179,
    _MM_PERM_CDBA = 180,
    _MM_PERM_CDBB = 181,
    _MM_PERM_CDBC = 182,
    _MM_PERM_CDBD = 183,
    _MM_PERM_CDCA = 184,
    _MM_PERM_CDCB = 185,
    _MM_PERM_CDCC = 186,
    _MM_PERM_CDCD = 187,
    _MM_PERM_CDDA = 188,
    _MM_PERM_CDDB = 189,
    _MM_PERM_CDDC = 190,
    _MM_PERM_CDDD = 191,
    _MM_PERM_DAAA = 192,
    _MM_PERM_DAAB = 193,
    _MM_PERM_DAAC = 194,
    _MM_PERM_DAAD = 195,
    _MM_PERM_DABA = 196,
    _MM_PERM_DABB = 197,
    _MM_PERM_DABC = 198,
    _MM_PERM_DABD = 199,
    _MM_PERM_DACA = 200,
    _MM_PERM_DACB = 201,
    _MM_PERM_DACC = 202,
    _MM_PERM_DACD = 203,
    _MM_PERM_DADA = 204,
    _MM_PERM_DADB = 205,
    _MM_PERM_DADC = 206,
    _MM_PERM_DADD = 207,
    _MM_PERM_DBAA = 208,
    _MM_PERM_DBAB = 209,
    _MM_PERM_DBAC = 210,
    _MM_PERM_DBAD = 211,
    _MM_PERM_DBBA = 212,
    _MM_PERM_DBBB = 213,
    _MM_PERM_DBBC = 214,
    _MM_PERM_DBBD = 215,
    _MM_PERM_DBCA = 216,
    _MM_PERM_DBCB = 217,
    _MM_PERM_DBCC = 218,
    _MM_PERM_DBCD = 219,
    _MM_PERM_DBDA = 220,
    _MM_PERM_DBDB = 221,
    _MM_PERM_DBDC = 222,
    _MM_PERM_DBDD = 223,
    _MM_PERM_DCAA = 224,
    _MM_PERM_DCAB = 225,
    _MM_PERM_DCAC = 226,
    _MM_PERM_DCAD = 227,
    _MM_PERM_DCBA = 228,
    _MM_PERM_DCBB = 229,
    _MM_PERM_DCBC = 230,
    _MM_PERM_DCBD = 231,
    _MM_PERM_DCCA = 232,
    _MM_PERM_DCCB = 233,
    _MM_PERM_DCCC = 234,
    _MM_PERM_DCCD = 235,
    _MM_PERM_DCDA = 236,
    _MM_PERM_DCDB = 237,
    _MM_PERM_DCDC = 238,
    _MM_PERM_DCDD = 239,
    _MM_PERM_DDAA = 240,
    _MM_PERM_DDAB = 241,
    _MM_PERM_DDAC = 242,
    _MM_PERM_DDAD = 243,
    _MM_PERM_DDBA = 244,
    _MM_PERM_DDBB = 245,
    _MM_PERM_DDBC = 246,
    _MM_PERM_DDBD = 247,
    _MM_PERM_DDCA = 248,
    _MM_PERM_DDCB = 249,
    _MM_PERM_DDCC = 250,
    _MM_PERM_DDCD = 251,
    _MM_PERM_DDDA = 252,
    _MM_PERM_DDDB = 253,
    _MM_PERM_DDDC = 254,
    _MM_PERM_DDDD = 255,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _MM_MANTISSA_NORM_ENUM {
    _MM_MANT_NORM_1_2 = 0,
    _MM_MANT_NORM_p5_2 = 1,
    _MM_MANT_NORM_p5_1 = 2,
    _MM_MANT_NORM_p75_1p5 = 3,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _MM_MANTISSA_SIGN_ENUM {
    _MM_MANT_SIGN_src = 0,
    _MM_MANT_SIGN_zero = 1,
    _MM_MANT_SIGN_nan = 2,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _MM_TERNLOG_ENUM {
    _MM_TERNLOG_A = 240,
    _MM_TERNLOG_B = 204,
    _MM_TERNLOG_C = 170,
}
pub type __v2hi = [::std::os::raw::c_short; 2usize];
pub type __v4qi = [::std::os::raw::c_char; 4usize];
pub type __v2qi = [::std::os::raw::c_char; 2usize];
pub type __mmask32 = ::std::os::raw::c_uint;
pub type __mmask64 = ::std::os::raw::c_ulonglong;
pub type __v32hf = [__BindgenFloat16; 32usize];
pub type __m512h = [__BindgenFloat16; 32usize];
pub type __m512h_u = [__BindgenFloat16; 32usize];
pub type __v32bf = __BindgenOpaqueArray<u8, 64usize>;
pub type __m512bh = __BindgenOpaqueArray<u8, 64usize>;
pub type __bfloat16 = u16;
extern "C" {
    pub fn _xgetbv(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _xsetbv(arg1: ::std::os::raw::c_uint, arg2: ::std::os::raw::c_ulonglong);
}
pub type _tile1024i = [::std::os::raw::c_int; 256usize];
#[repr(C)]
#[repr(align(1024))]
#[derive(Debug, Copy, Clone)]
pub struct __tile1024i_str {
    pub row: ::std::os::raw::c_ushort,
    pub col: ::std::os::raw::c_ushort,
    pub __bindgen_padding_0: [u64; 127usize],
    pub tile: _tile1024i,
}
#[test]
fn bindgen_test_layout___tile1024i_str() {
    const UNINIT: ::std::mem::MaybeUninit<__tile1024i_str> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__tile1024i_str>(),
        2048usize,
        "Size of __tile1024i_str"
    );
    assert_eq!(
        ::std::mem::align_of::<__tile1024i_str>(),
        1024usize,
        "Alignment of __tile1024i_str"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).row) as usize - ptr as usize },
        0usize,
        "Offset of field: __tile1024i_str::row"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).col) as usize - ptr as usize },
        2usize,
        "Offset of field: __tile1024i_str::col"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tile) as usize - ptr as usize },
        1024usize,
        "Offset of field: __tile1024i_str::tile"
    );
}
impl Default for __tile1024i_str {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __tile1024i = __tile1024i_str;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Default, Copy, Clone)]
pub struct _SETJMP_FLOAT128 {
    pub Part: [::std::os::raw::c_ulonglong; 2usize],
}
#[test]
fn bindgen_test_layout__SETJMP_FLOAT128() {
    const UNINIT: ::std::mem::MaybeUninit<_SETJMP_FLOAT128> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_SETJMP_FLOAT128>(),
        16usize,
        "Size of _SETJMP_FLOAT128"
    );
    assert_eq!(
        ::std::mem::align_of::<_SETJMP_FLOAT128>(),
        16usize,
        "Alignment of _SETJMP_FLOAT128"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Part) as usize - ptr as usize },
        0usize,
        "Offset of field: _SETJMP_FLOAT128::Part"
    );
}
pub type SETJMP_FLOAT128 = _SETJMP_FLOAT128;
pub type _JBTYPE = SETJMP_FLOAT128;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Default, Copy, Clone)]
pub struct _JUMP_BUFFER {
    pub Frame: ::std::os::raw::c_ulonglong,
    pub Rbx: ::std::os::raw::c_ulonglong,
    pub Rsp: ::std::os::raw::c_ulonglong,
    pub Rbp: ::std::os::raw::c_ulonglong,
    pub Rsi: ::std::os::raw::c_ulonglong,
    pub Rdi: ::std::os::raw::c_ulonglong,
    pub R12: ::std::os::raw::c_ulonglong,
    pub R13: ::std::os::raw::c_ulonglong,
    pub R14: ::std::os::raw::c_ulonglong,
    pub R15: ::std::os::raw::c_ulonglong,
    pub Rip: ::std::os::raw::c_ulonglong,
    pub MxCsr: ::std::os::raw::c_ulong,
    pub FpCsr: ::std::os::raw::c_ushort,
    pub Spare: ::std::os::raw::c_ushort,
    pub Xmm6: SETJMP_FLOAT128,
    pub Xmm7: SETJMP_FLOAT128,
    pub Xmm8: SETJMP_FLOAT128,
    pub Xmm9: SETJMP_FLOAT128,
    pub Xmm10: SETJMP_FLOAT128,
    pub Xmm11: SETJMP_FLOAT128,
    pub Xmm12: SETJMP_FLOAT128,
    pub Xmm13: SETJMP_FLOAT128,
    pub Xmm14: SETJMP_FLOAT128,
    pub Xmm15: SETJMP_FLOAT128,
}
#[test]
fn bindgen_test_layout__JUMP_BUFFER() {
    const UNINIT: ::std::mem::MaybeUninit<_JUMP_BUFFER> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_JUMP_BUFFER>(),
        256usize,
        "Size of _JUMP_BUFFER"
    );
    assert_eq!(
        ::std::mem::align_of::<_JUMP_BUFFER>(),
        16usize,
        "Alignment of _JUMP_BUFFER"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Frame) as usize - ptr as usize },
        0usize,
        "Offset of field: _JUMP_BUFFER::Frame"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rbx) as usize - ptr as usize },
        8usize,
        "Offset of field: _JUMP_BUFFER::Rbx"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rsp) as usize - ptr as usize },
        16usize,
        "Offset of field: _JUMP_BUFFER::Rsp"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rbp) as usize - ptr as usize },
        24usize,
        "Offset of field: _JUMP_BUFFER::Rbp"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rsi) as usize - ptr as usize },
        32usize,
        "Offset of field: _JUMP_BUFFER::Rsi"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rdi) as usize - ptr as usize },
        40usize,
        "Offset of field: _JUMP_BUFFER::Rdi"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).R12) as usize - ptr as usize },
        48usize,
        "Offset of field: _JUMP_BUFFER::R12"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).R13) as usize - ptr as usize },
        56usize,
        "Offset of field: _JUMP_BUFFER::R13"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).R14) as usize - ptr as usize },
        64usize,
        "Offset of field: _JUMP_BUFFER::R14"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).R15) as usize - ptr as usize },
        72usize,
        "Offset of field: _JUMP_BUFFER::R15"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rip) as usize - ptr as usize },
        80usize,
        "Offset of field: _JUMP_BUFFER::Rip"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MxCsr) as usize - ptr as usize },
        88usize,
        "Offset of field: _JUMP_BUFFER::MxCsr"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FpCsr) as usize - ptr as usize },
        92usize,
        "Offset of field: _JUMP_BUFFER::FpCsr"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Spare) as usize - ptr as usize },
        94usize,
        "Offset of field: _JUMP_BUFFER::Spare"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm6) as usize - ptr as usize },
        96usize,
        "Offset of field: _JUMP_BUFFER::Xmm6"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm7) as usize - ptr as usize },
        112usize,
        "Offset of field: _JUMP_BUFFER::Xmm7"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm8) as usize - ptr as usize },
        128usize,
        "Offset of field: _JUMP_BUFFER::Xmm8"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm9) as usize - ptr as usize },
        144usize,
        "Offset of field: _JUMP_BUFFER::Xmm9"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm10) as usize - ptr as usize },
        160usize,
        "Offset of field: _JUMP_BUFFER::Xmm10"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm11) as usize - ptr as usize },
        176usize,
        "Offset of field: _JUMP_BUFFER::Xmm11"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm12) as usize - ptr as usize },
        192usize,
        "Offset of field: _JUMP_BUFFER::Xmm12"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm13) as usize - ptr as usize },
        208usize,
        "Offset of field: _JUMP_BUFFER::Xmm13"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm14) as usize - ptr as usize },
        224usize,
        "Offset of field: _JUMP_BUFFER::Xmm14"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm15) as usize - ptr as usize },
        240usize,
        "Offset of field: _JUMP_BUFFER::Xmm15"
    );
}
pub type jmp_buf = [_JBTYPE; 16usize];
extern "C" {
    pub fn _setjmp(_Buf: *mut _JBTYPE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn longjmp(_Buf: *mut _JBTYPE, _Value: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn _m_from_float(arg1: f32) -> __m64;
}
extern "C" {
    pub fn _m_to_float(arg1: __m64) -> f32;
}
extern "C" {
    pub fn __addfsbyte(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn __addfsdword(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn __addfsword(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_ushort);
}
extern "C" {
    pub fn __code_seg(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn __cpuid(arg1: *mut ::std::os::raw::c_int, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn __cpuidex(
        arg1: *mut ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn __emul(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __emulu(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn __getcallerseflags() -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn __inbytestring(
        arg1: ::std::os::raw::c_ushort,
        arg2: *mut ::std::os::raw::c_uchar,
        arg3: ::std::os::raw::c_ulong,
    );
}
extern "C" {
    pub fn __incfsbyte(arg1: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn __incfsdword(arg1: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn __incfsword(arg1: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn __indwordstring(
        arg1: ::std::os::raw::c_ushort,
        arg2: *mut ::std::os::raw::c_ulong,
        arg3: ::std::os::raw::c_ulong,
    );
}
extern "C" {
    pub fn __int2c() -> !;
}
extern "C" {
    pub fn __invlpg(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn __inwordstring(
        arg1: ::std::os::raw::c_ushort,
        arg2: *mut ::std::os::raw::c_ushort,
        arg3: ::std::os::raw::c_ulong,
    );
}
extern "C" {
    pub fn __lidt(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn __ll_lshift(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn __ll_rshift(
        arg1: ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __nvreg_restore_fence();
}
extern "C" {
    pub fn __nvreg_save_fence();
}
extern "C" {
    pub fn __outbytestring(
        arg1: ::std::os::raw::c_ushort,
        arg2: *mut ::std::os::raw::c_uchar,
        arg3: ::std::os::raw::c_ulong,
    );
}
extern "C" {
    pub fn __outdwordstring(
        arg1: ::std::os::raw::c_ushort,
        arg2: *mut ::std::os::raw::c_ulong,
        arg3: ::std::os::raw::c_ulong,
    );
}
extern "C" {
    pub fn __outwordstring(
        arg1: ::std::os::raw::c_ushort,
        arg2: *mut ::std::os::raw::c_ushort,
        arg3: ::std::os::raw::c_ulong,
    );
}
extern "C" {
    pub fn __readcr0() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __readcr2() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __readcr4() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __readcr8() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __readdr(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn __readpmc(arg1: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn __segmentlimit(arg1: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __sidt(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn __stosb(
        arg1: *mut ::std::os::raw::c_uchar,
        arg2: ::std::os::raw::c_uchar,
        arg3: ::std::os::raw::c_ulonglong,
    );
}
extern "C" {
    pub fn __svm_clgi();
}
extern "C" {
    pub fn __svm_invlpga(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn __svm_skinit(arg1: ::std::os::raw::c_int);
}
extern "C" {
    pub fn __svm_stgi();
}
extern "C" {
    pub fn __svm_vmload(arg1: usize);
}
extern "C" {
    pub fn __svm_vmrun(arg1: usize);
}
extern "C" {
    pub fn __svm_vmsave(arg1: usize);
}
extern "C" {
    pub fn __ud2() -> !;
}
extern "C" {
    pub fn __ull_rshift(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn __vmx_off();
}
extern "C" {
    pub fn __vmx_vmptrst(arg1: *mut ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn __wbinvd();
}
extern "C" {
    pub fn __writecr0(arg1: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn __writecr4(arg1: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn __writecr8(arg1: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn __writedr(arg1: ::std::os::raw::c_uint, arg2: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn __writefsbyte(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn __writefsdword(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn __writefsqword(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn __writefsword(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_ushort);
}
extern "C" {
    pub fn __writemsr(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _AddressOfReturnAddress() -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _bittest(
        arg1: *const ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _bittestandcomplement(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _bittestandreset(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _bittestandset(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _disable();
}
extern "C" {
    pub fn _enable();
}
extern "C" {
    pub fn _InterlockedAddLargeStatistic(
        _Addend: *mut ::std::os::raw::c_longlong,
        _Value: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _interlockedbittestandreset(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _interlockedbittestandset(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _InterlockedCompareExchangePointer_HLEAcquire(
        arg1: *mut *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _InterlockedCompareExchangePointer_HLERelease(
        arg1: *mut *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _InterlockedExchangeAdd_HLEAcquire(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedExchangeAdd_HLERelease(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedExchangeAdd64_HLEAcquire(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedExchangeAdd64_HLERelease(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _ReadBarrier();
}
extern "C" {
    pub fn _rorx_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _sarx_i32(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _shlx_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _shrx_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _Store_HLERelease(arg1: *mut ::std::os::raw::c_long, arg2: ::std::os::raw::c_long);
}
extern "C" {
    pub fn _Store64_HLERelease(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn _StorePointer_HLERelease(
        arg1: *mut *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn _WriteBarrier();
}
extern "C" {
    pub fn xbegin() -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn __addgsbyte(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn __addgsdword(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn __addgsqword(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn __addgsword(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_ushort);
}
extern "C" {
    pub fn __faststorefence();
}
extern "C" {
    pub fn __incgsbyte(arg1: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn __incgsdword(arg1: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn __incgsqword(arg1: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn __incgsword(arg1: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn __readgsbyte(arg1: ::std::os::raw::c_ulong) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn __readgsdword(arg1: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __readgsqword(arg1: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn __readgsword(arg1: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn __vmx_on(arg1: *mut ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn __vmx_vmclear(arg1: *mut ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn __vmx_vmlaunch() -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn __vmx_vmptrld(arg1: *mut ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn __vmx_vmread(arg1: usize, arg2: *mut usize) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn __vmx_vmresume() -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn __vmx_vmwrite(arg1: usize, arg2: usize) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn __writegsbyte(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_uchar);
}
extern "C" {
    pub fn __writegsdword(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn __writegsqword(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn __writegsword(arg1: ::std::os::raw::c_ulong, arg2: ::std::os::raw::c_ushort);
}
extern "C" {
    pub fn _bittest64(
        arg1: *const ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _bittestandcomplement64(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _bittestandreset64(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _bittestandset64(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _InterlockedAnd_np(
        _Value: *mut ::std::os::raw::c_long,
        _Mask: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedAnd16_np(
        _Value: *mut ::std::os::raw::c_short,
        _Mask: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _InterlockedAnd64_np(
        _Value: *mut ::std::os::raw::c_longlong,
        _Mask: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedAnd8_np(
        _Value: *mut ::std::os::raw::c_char,
        _Mask: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn _interlockedbittestandreset64(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _interlockedbittestandset64(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _InterlockedCompareExchange_np(
        _Destination: *mut ::std::os::raw::c_long,
        _Exchange: ::std::os::raw::c_long,
        _Comparand: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedCompareExchange128_np(
        _Destination: *mut ::std::os::raw::c_longlong,
        _ExchangeHigh: ::std::os::raw::c_longlong,
        _ExchangeLow: ::std::os::raw::c_longlong,
        _ComparandResult: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _InterlockedCompareExchange16_np(
        _Destination: *mut ::std::os::raw::c_short,
        _Exchange: ::std::os::raw::c_short,
        _Comparand: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _InterlockedCompareExchange64_np(
        _Destination: *mut ::std::os::raw::c_longlong,
        _Exchange: ::std::os::raw::c_longlong,
        _Comparand: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedCompareExchangePointer_np(
        _Destination: *mut *mut ::std::os::raw::c_void,
        _Exchange: *mut ::std::os::raw::c_void,
        _Comparand: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _InterlockedOr_np(
        _Value: *mut ::std::os::raw::c_long,
        _Mask: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedOr16_np(
        _Value: *mut ::std::os::raw::c_short,
        _Mask: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _InterlockedOr64_np(
        _Value: *mut ::std::os::raw::c_longlong,
        _Mask: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedOr8_np(
        _Value: *mut ::std::os::raw::c_char,
        _Mask: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn _InterlockedXor_np(
        _Value: *mut ::std::os::raw::c_long,
        _Mask: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedXor16_np(
        _Value: *mut ::std::os::raw::c_short,
        _Mask: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _InterlockedXor64_np(
        _Value: *mut ::std::os::raw::c_longlong,
        _Mask: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedXor8_np(
        _Value: *mut ::std::os::raw::c_char,
        _Mask: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn _rorx_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _sarx_i64(
        arg1: ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _shlx_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _shrx_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn __mulh(
        arg1: ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __umulh(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _mul128(
        arg1: ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
        arg3: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
pub type _Wint_t = wchar_t;
extern "C" {
    pub fn _wsetlocale(_Category: ::std::os::raw::c_int, _Locale: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcreate_locale(_Category: ::std::os::raw::c_int, _Locale: *const wchar_t) -> _locale_t;
}
extern "C" {
    pub fn btowc(_Ch: ::std::os::raw::c_int) -> wint_t;
}
extern "C" {
    pub fn mbrlen(
        _Ch: *const ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _State: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn mbrtowc(
        _DstCh: *mut wchar_t,
        _SrcCh: *const ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _State: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn mbsrtowcs_s(
        _Retval: *mut usize,
        _Dst: *mut wchar_t,
        _Size: usize,
        _PSrc: *mut *const ::std::os::raw::c_char,
        _N: usize,
        _State: *mut mbstate_t,
    ) -> errno_t;
}
extern "C" {
    pub fn mbsrtowcs(
        _Dest: *mut wchar_t,
        _PSrc: *mut *const ::std::os::raw::c_char,
        _Count: usize,
        _State: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wcrtomb_s(
        _Retval: *mut usize,
        _Dst: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _Ch: wchar_t,
        _State: *mut mbstate_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcrtomb(
        _Dest: *mut ::std::os::raw::c_char,
        _Source: wchar_t,
        _State: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wcsrtombs_s(
        _Retval: *mut usize,
        _Dst: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _Src: *mut *const wchar_t,
        _Size: usize,
        _State: *mut mbstate_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsrtombs(
        _Dest: *mut ::std::os::raw::c_char,
        _PSource: *mut *const wchar_t,
        _Count: usize,
        _State: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wctob(_WCh: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wmemcpy_s(_S1: *mut wchar_t, _N1: rsize_t, _S2: *const wchar_t, _N: rsize_t) -> errno_t;
}
extern "C" {
    pub fn wmemmove_s(_S1: *mut wchar_t, _N1: rsize_t, _S2: *const wchar_t, _N: rsize_t)
        -> errno_t;
}
extern "C" {
    pub static mut _Avx2WmemEnabled: ::std::os::raw::c_int;
}
pub const _Avx2WmemEnabledWeakValue: ::std::os::raw::c_int = 0;
pub type AppId = ::std::os::raw::c_ulonglong;
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_DLSS_Hint_Render_Preset {
    NVSDK_NGX_DLSS_Hint_Render_Preset_Default = 0,
    NVSDK_NGX_DLSS_Hint_Render_Preset_A = 1,
    NVSDK_NGX_DLSS_Hint_Render_Preset_B = 2,
    NVSDK_NGX_DLSS_Hint_Render_Preset_C = 3,
    NVSDK_NGX_DLSS_Hint_Render_Preset_D = 4,
    NVSDK_NGX_DLSS_Hint_Render_Preset_E = 5,
    NVSDK_NGX_DLSS_Hint_Render_Preset_F = 6,
    NVSDK_NGX_DLSS_Hint_Render_Preset_G = 7,
    NVSDK_NGX_DLSS_Hint_Render_Preset_H_Reserved = 8,
    NVSDK_NGX_DLSS_Hint_Render_Preset_I_Reserved = 9,
    NVSDK_NGX_DLSS_Hint_Render_Preset_J = 10,
    NVSDK_NGX_DLSS_Hint_Render_Preset_K = 11,
    NVSDK_NGX_DLSS_Hint_Render_Preset_L = 12,
    NVSDK_NGX_DLSS_Hint_Render_Preset_M = 13,
    NVSDK_NGX_DLSS_Hint_Render_Preset_N = 14,
    NVSDK_NGX_DLSS_Hint_Render_Preset_O = 15,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_FeatureCommonInfo_Internal {
    _unused: [u8; 0],
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Version {
    NVSDK_NGX_Version_API = 21,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Result {
    NVSDK_NGX_Result_Success = 1,
    NVSDK_NGX_Result_Fail = -1160773632,
    NVSDK_NGX_Result_FAIL_FeatureNotSupported = -1160773631,
    NVSDK_NGX_Result_FAIL_PlatformError = -1160773630,
    NVSDK_NGX_Result_FAIL_FeatureAlreadyExists = -1160773629,
    NVSDK_NGX_Result_FAIL_FeatureNotFound = -1160773628,
    NVSDK_NGX_Result_FAIL_InvalidParameter = -1160773627,
    NVSDK_NGX_Result_FAIL_ScratchBufferTooSmall = -1160773626,
    NVSDK_NGX_Result_FAIL_NotInitialized = -1160773625,
    NVSDK_NGX_Result_FAIL_UnsupportedInputFormat = -1160773624,
    NVSDK_NGX_Result_FAIL_RWFlagMissing = -1160773623,
    NVSDK_NGX_Result_FAIL_MissingInput = -1160773622,
    NVSDK_NGX_Result_FAIL_UnableToInitializeFeature = -1160773621,
    NVSDK_NGX_Result_FAIL_OutOfDate = -1160773620,
    NVSDK_NGX_Result_FAIL_OutOfGPUMemory = -1160773619,
    NVSDK_NGX_Result_FAIL_UnsupportedFormat = -1160773618,
    NVSDK_NGX_Result_FAIL_UnableToWriteToAppDataPath = -1160773617,
    NVSDK_NGX_Result_FAIL_UnsupportedParameter = -1160773616,
    NVSDK_NGX_Result_FAIL_Denied = -1160773615,
    NVSDK_NGX_Result_FAIL_NotImplemented = -1160773614,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Feature {
    NVSDK_NGX_Feature_Reserved0 = 0,
    NVSDK_NGX_Feature_SuperSampling = 1,
    NVSDK_NGX_Feature_InPainting = 2,
    NVSDK_NGX_Feature_ImageSuperResolution = 3,
    NVSDK_NGX_Feature_SlowMotion = 4,
    NVSDK_NGX_Feature_VideoSuperResolution = 5,
    NVSDK_NGX_Feature_Reserved1 = 6,
    NVSDK_NGX_Feature_Reserved2 = 7,
    NVSDK_NGX_Feature_Reserved3 = 8,
    NVSDK_NGX_Feature_ImageSignalProcessing = 9,
    NVSDK_NGX_Feature_DeepResolve = 10,
    NVSDK_NGX_Feature_FrameGeneration = 11,
    NVSDK_NGX_Feature_DeepDVC = 12,
    NVSDK_NGX_Feature_RayReconstruction = 13,
    NVSDK_NGX_Feature_Reserved14 = 14,
    NVSDK_NGX_Feature_Reserved15 = 15,
    NVSDK_NGX_Feature_Reserved16 = 16,
    NVSDK_NGX_Feature_Count = 17,
    NVSDK_NGX_Feature_Reserved_SDK = 32764,
    NVSDK_NGX_Feature_Reserved_Core = 32765,
    NVSDK_NGX_Feature_Reserved_Unknown = 32766,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Buffer_Format {
    NVSDK_NGX_Buffer_Format_Unknown = 0,
    NVSDK_NGX_Buffer_Format_RGB8UI = 1,
    NVSDK_NGX_Buffer_Format_RGB16F = 2,
    NVSDK_NGX_Buffer_Format_RGB32F = 3,
    NVSDK_NGX_Buffer_Format_RGBA8UI = 4,
    NVSDK_NGX_Buffer_Format_RGBA16F = 5,
    NVSDK_NGX_Buffer_Format_RGBA32F = 6,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_PerfQuality_Value {
    NVSDK_NGX_PerfQuality_Value_MaxPerf = 0,
    NVSDK_NGX_PerfQuality_Value_Balanced = 1,
    NVSDK_NGX_PerfQuality_Value_MaxQuality = 2,
    NVSDK_NGX_PerfQuality_Value_UltraPerformance = 3,
    NVSDK_NGX_PerfQuality_Value_UltraQuality = 4,
    NVSDK_NGX_PerfQuality_Value_DLAA = 5,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_RTX_Value {
    NVSDK_NGX_RTX_Value_Off = 0,
    NVSDK_NGX_RTX_Value_On = 1,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_DLSS_Mode {
    NVSDK_NGX_DLSS_Mode_Off = 0,
    NVSDK_NGX_DLSS_Mode_DLSS_DLISP = 1,
    NVSDK_NGX_DLSS_Mode_DLISP_Only = 2,
    NVSDK_NGX_DLSS_Mode_DLSS = 3,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NVSDK_NGX_Handle {
    pub Id: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Handle() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Handle> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Handle>(),
        4usize,
        "Size of NVSDK_NGX_Handle"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Handle>(),
        4usize,
        "Alignment of NVSDK_NGX_Handle"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Id) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Handle::Id"
    );
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_GPU_Arch {
    NVSDK_NGX_GPU_Arch_NotSupported = 0,
    NVSDK_NGX_GPU_Arch_Volta = 320,
    NVSDK_NGX_GPU_Arch_Turing = 352,
    NVSDK_NGX_GPU_Arch_Ampere = 368,
    NVSDK_NGX_GPU_Arch_Ada = 400,
    NVSDK_NGX_GPU_Arch_Hopper = 384,
    NVSDK_NGX_GPU_Arch_Blackwell = 416,
    NVSDK_NGX_GPU_Arch_Blackwell2 = 432,
    NVSDK_NGX_GPU_Arch_Unknown = 134217727,
}
impl NVSDK_NGX_DLSS_Feature_Flags {
    pub const NVSDK_NGX_DLSS_Feature_Flags_IsInvalid: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(-2147483648);
    pub const NVSDK_NGX_DLSS_Feature_Flags_None: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(0);
    pub const NVSDK_NGX_DLSS_Feature_Flags_IsHDR: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(1);
    pub const NVSDK_NGX_DLSS_Feature_Flags_MVLowRes: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(2);
    pub const NVSDK_NGX_DLSS_Feature_Flags_MVJittered: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(4);
    pub const NVSDK_NGX_DLSS_Feature_Flags_DepthInverted: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(8);
    pub const NVSDK_NGX_DLSS_Feature_Flags_Reserved_0: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(16);
    pub const NVSDK_NGX_DLSS_Feature_Flags_DoSharpening: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(32);
    pub const NVSDK_NGX_DLSS_Feature_Flags_AutoExposure: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(64);
    pub const NVSDK_NGX_DLSS_Feature_Flags_AlphaUpscaling: NVSDK_NGX_DLSS_Feature_Flags =
        NVSDK_NGX_DLSS_Feature_Flags(128);
}
impl ::std::ops::BitOr<NVSDK_NGX_DLSS_Feature_Flags> for NVSDK_NGX_DLSS_Feature_Flags {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        NVSDK_NGX_DLSS_Feature_Flags(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for NVSDK_NGX_DLSS_Feature_Flags {
    #[inline]
    fn bitor_assign(&mut self, rhs: NVSDK_NGX_DLSS_Feature_Flags) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<NVSDK_NGX_DLSS_Feature_Flags> for NVSDK_NGX_DLSS_Feature_Flags {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        NVSDK_NGX_DLSS_Feature_Flags(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for NVSDK_NGX_DLSS_Feature_Flags {
    #[inline]
    fn bitand_assign(&mut self, rhs: NVSDK_NGX_DLSS_Feature_Flags) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct NVSDK_NGX_DLSS_Feature_Flags(pub ::std::os::raw::c_int);
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_ToneMapperType {
    NVSDK_NGX_TONEMAPPER_STRING = 0,
    NVSDK_NGX_TONEMAPPER_REINHARD = 1,
    NVSDK_NGX_TONEMAPPER_ONEOVERLUMA = 2,
    NVSDK_NGX_TONEMAPPER_ACES = 3,
    NVSDK_NGX_TONEMAPPERTYPE_NUM = 4,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_GBufferType {
    NVSDK_NGX_GBUFFER_ALBEDO = 0,
    NVSDK_NGX_GBUFFER_ROUGHNESS = 1,
    NVSDK_NGX_GBUFFER_METALLIC = 2,
    NVSDK_NGX_GBUFFER_SPECULAR = 3,
    NVSDK_NGX_GBUFFER_SUBSURFACE = 4,
    NVSDK_NGX_GBUFFER_NORMALS = 5,
    NVSDK_NGX_GBUFFER_SHADINGMODELID = 6,
    NVSDK_NGX_GBUFFER_MATERIALID = 7,
    NVSDK_NGX_GBUFFER_SPECULAR_ALBEDO = 8,
    NVSDK_NGX_GBUFFER_INDIRECT_ALBEDO = 9,
    NVSDK_NGX_GBUFFER_SPECULAR_MVEC = 10,
    NVSDK_NGX_GBUFFER_DISOCCL_MASK = 11,
    NVSDK_NGX_GBUFFER_EMISSIVE = 12,
    NVSDK_NGX_GBUFFERTYPE_NUM = 16,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NVSDK_NGX_Coordinates {
    pub X: ::std::os::raw::c_uint,
    pub Y: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Coordinates() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Coordinates> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Coordinates>(),
        8usize,
        "Size of NVSDK_NGX_Coordinates"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Coordinates>(),
        4usize,
        "Alignment of NVSDK_NGX_Coordinates"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).X) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Coordinates::X"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Y) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_Coordinates::Y"
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NVSDK_NGX_Dimensions {
    pub Width: ::std::os::raw::c_uint,
    pub Height: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Dimensions() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Dimensions> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Dimensions>(),
        8usize,
        "Size of NVSDK_NGX_Dimensions"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Dimensions>(),
        4usize,
        "Alignment of NVSDK_NGX_Dimensions"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Width) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Dimensions::Width"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Height) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_Dimensions::Height"
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct NVSDK_NGX_PrecisionInfo {
    pub IsLowPrecision: ::std::os::raw::c_uint,
    pub Bias: f32,
    pub Scale: f32,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_PrecisionInfo() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_PrecisionInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_PrecisionInfo>(),
        12usize,
        "Size of NVSDK_NGX_PrecisionInfo"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_PrecisionInfo>(),
        4usize,
        "Alignment of NVSDK_NGX_PrecisionInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IsLowPrecision) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_PrecisionInfo::IsLowPrecision"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Bias) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_PrecisionInfo::Bias"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Scale) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_PrecisionInfo::Scale"
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_PathListInfo {
    pub Path: *const *const wchar_t,
    pub Length: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_PathListInfo() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_PathListInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_PathListInfo>(),
        16usize,
        "Size of NVSDK_NGX_PathListInfo"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_PathListInfo>(),
        8usize,
        "Alignment of NVSDK_NGX_PathListInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Path) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_PathListInfo::Path"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_PathListInfo::Length"
    );
}
impl Default for NVSDK_NGX_PathListInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Logging_Level {
    NVSDK_NGX_LOGGING_LEVEL_OFF = 0,
    NVSDK_NGX_LOGGING_LEVEL_ON = 1,
    NVSDK_NGX_LOGGING_LEVEL_VERBOSE = 2,
    NVSDK_NGX_LOGGING_LEVEL_NUM = 3,
}
pub type NVSDK_NGX_AppLogCallback = ::std::option::Option<
    unsafe extern "C" fn(
        message: *const ::std::os::raw::c_char,
        loggingLevel: NVSDK_NGX_Logging_Level,
        sourceComponent: NVSDK_NGX_Feature,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_LoggingInfo {
    pub LoggingCallback: NVSDK_NGX_AppLogCallback,
    pub MinimumLoggingLevel: NVSDK_NGX_Logging_Level,
    pub DisableOtherLoggingSinks: bool,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_LoggingInfo() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_LoggingInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_LoggingInfo>(),
        16usize,
        "Size of NVSDK_NGX_LoggingInfo"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_LoggingInfo>(),
        8usize,
        "Alignment of NVSDK_NGX_LoggingInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LoggingCallback) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_LoggingInfo::LoggingCallback"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinimumLoggingLevel) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_LoggingInfo::MinimumLoggingLevel"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DisableOtherLoggingSinks) as usize - ptr as usize },
        12usize,
        "Offset of field: NVSDK_NGX_LoggingInfo::DisableOtherLoggingSinks"
    );
}
impl Default for NVSDK_NGX_LoggingInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_FeatureCommonInfo {
    pub PathListInfo: NVSDK_NGX_PathListInfo,
    pub InternalData: *mut NVSDK_NGX_FeatureCommonInfo_Internal,
    pub LoggingInfo: NVSDK_NGX_LoggingInfo,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_FeatureCommonInfo() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_FeatureCommonInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_FeatureCommonInfo>(),
        40usize,
        "Size of NVSDK_NGX_FeatureCommonInfo"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_FeatureCommonInfo>(),
        8usize,
        "Alignment of NVSDK_NGX_FeatureCommonInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PathListInfo) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_FeatureCommonInfo::PathListInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InternalData) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_FeatureCommonInfo::InternalData"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LoggingInfo) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_FeatureCommonInfo::LoggingInfo"
    );
}
impl Default for NVSDK_NGX_FeatureCommonInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Resource_VK_Type {
    NVSDK_NGX_RESOURCE_VK_TYPE_VK_IMAGEVIEW = 0,
    NVSDK_NGX_RESOURCE_VK_TYPE_VK_BUFFER = 1,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Opt_Level {
    NVSDK_NGX_OPT_LEVEL_UNDEFINED = 0,
    NVSDK_NGX_OPT_LEVEL_DEBUG = 20,
    NVSDK_NGX_OPT_LEVEL_DEVELOP = 30,
    NVSDK_NGX_OPT_LEVEL_RELEASE = 40,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_EngineType {
    NVSDK_NGX_ENGINE_TYPE_CUSTOM = 0,
    NVSDK_NGX_ENGINE_TYPE_UNREAL = 1,
    NVSDK_NGX_ENGINE_TYPE_UNITY = 2,
    NVSDK_NGX_ENGINE_TYPE_OMNIVERSE = 3,
    NVSDK_NGX_ENGINE_COUNT = 4,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Feature_Support_Result {
    NVSDK_NGX_FeatureSupportResult_Supported = 0,
    NVSDK_NGX_FeatureSupportResult_CheckNotPresent = 1,
    NVSDK_NGX_FeatureSupportResult_DriverVersionUnsupported = 2,
    NVSDK_NGX_FeatureSupportResult_AdapterUnsupported = 4,
    NVSDK_NGX_FeatureSupportResult_OSVersionBelowMinimumSupported = 8,
    NVSDK_NGX_FeatureSupportResult_NotImplemented = 16,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_Application_Identifier_Type {
    NVSDK_NGX_Application_Identifier_Type_Application_Id = 0,
    NVSDK_NGX_Application_Identifier_Type_Project_Id = 1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_ProjectIdDescription {
    pub ProjectId: *const ::std::os::raw::c_char,
    pub EngineType: NVSDK_NGX_EngineType,
    pub EngineVersion: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_ProjectIdDescription() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_ProjectIdDescription> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_ProjectIdDescription>(),
        24usize,
        "Size of NVSDK_NGX_ProjectIdDescription"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_ProjectIdDescription>(),
        8usize,
        "Alignment of NVSDK_NGX_ProjectIdDescription"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProjectId) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_ProjectIdDescription::ProjectId"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EngineType) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_ProjectIdDescription::EngineType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).EngineVersion) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_ProjectIdDescription::EngineVersion"
    );
}
impl Default for NVSDK_NGX_ProjectIdDescription {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NVSDK_NGX_Application_Identifier {
    pub IdentifierType: NVSDK_NGX_Application_Identifier_Type,
    pub v: v,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union v {
    pub ProjectDesc: NVSDK_NGX_ProjectIdDescription,
    pub ApplicationId: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_v() {
    const UNINIT: ::std::mem::MaybeUninit<v> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(::std::mem::size_of::<v>(), 24usize, "Size of v");
    assert_eq!(::std::mem::align_of::<v>(), 8usize, "Alignment of v");
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProjectDesc) as usize - ptr as usize },
        0usize,
        "Offset of field: v::ProjectDesc"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApplicationId) as usize - ptr as usize },
        0usize,
        "Offset of field: v::ApplicationId"
    );
}
impl Default for v {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for v {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "v {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Application_Identifier() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Application_Identifier> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Application_Identifier>(),
        32usize,
        "Size of NVSDK_NGX_Application_Identifier"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Application_Identifier>(),
        8usize,
        "Alignment of NVSDK_NGX_Application_Identifier"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).IdentifierType) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Application_Identifier::IdentifierType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_Application_Identifier::v"
    );
}
impl Default for NVSDK_NGX_Application_Identifier {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for NVSDK_NGX_Application_Identifier {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "NVSDK_NGX_Application_Identifier {{ IdentifierType: {:?}, v: {:?} }}",
            self.IdentifierType, self.v
        )
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct NVSDK_NGX_FeatureDiscoveryInfo {
    pub SDKVersion: NVSDK_NGX_Version,
    pub FeatureID: NVSDK_NGX_Feature,
    pub Identifier: NVSDK_NGX_Application_Identifier,
    pub ApplicationDataPath: *const wchar_t,
    pub FeatureInfo: *const NVSDK_NGX_FeatureCommonInfo,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_FeatureDiscoveryInfo() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_FeatureDiscoveryInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_FeatureDiscoveryInfo>(),
        56usize,
        "Size of NVSDK_NGX_FeatureDiscoveryInfo"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_FeatureDiscoveryInfo>(),
        8usize,
        "Alignment of NVSDK_NGX_FeatureDiscoveryInfo"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).SDKVersion) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_FeatureDiscoveryInfo::SDKVersion"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureID) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_FeatureDiscoveryInfo::FeatureID"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Identifier) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_FeatureDiscoveryInfo::Identifier"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ApplicationDataPath) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_FeatureDiscoveryInfo::ApplicationDataPath"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureInfo) as usize - ptr as usize },
        48usize,
        "Offset of field: NVSDK_NGX_FeatureDiscoveryInfo::FeatureInfo"
    );
}
impl Default for NVSDK_NGX_FeatureDiscoveryInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for NVSDK_NGX_FeatureDiscoveryInfo {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "NVSDK_NGX_FeatureDiscoveryInfo {{ SDKVersion: {:?}, FeatureID: {:?}, Identifier: {:?}, ApplicationDataPath: {:?}, FeatureInfo: {:?} }}" , self . SDKVersion , self . FeatureID , self . Identifier , self . ApplicationDataPath , self . FeatureInfo)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_FeatureRequirement {
    pub FeatureSupported: NVSDK_NGX_Feature_Support_Result,
    pub MinHWArchitecture: ::std::os::raw::c_uint,
    pub MinOSVersion: [::std::os::raw::c_char; 255usize],
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_FeatureRequirement() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_FeatureRequirement> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_FeatureRequirement>(),
        264usize,
        "Size of NVSDK_NGX_FeatureRequirement"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_FeatureRequirement>(),
        4usize,
        "Alignment of NVSDK_NGX_FeatureRequirement"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FeatureSupported) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_FeatureRequirement::FeatureSupported"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinHWArchitecture) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_FeatureRequirement::MinHWArchitecture"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MinOSVersion) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_FeatureRequirement::MinOSVersion"
    );
}
impl Default for NVSDK_NGX_FeatureRequirement {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D11Resource {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D12Resource {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_Feature_Create_Params {
    pub InWidth: ::std::os::raw::c_uint,
    pub InHeight: ::std::os::raw::c_uint,
    pub InTargetWidth: ::std::os::raw::c_uint,
    pub InTargetHeight: ::std::os::raw::c_uint,
    #[doc = " OPTIONAL"]
    pub InPerfQualityValue: NVSDK_NGX_PerfQuality_Value,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_Feature_Create_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_Feature_Create_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_Feature_Create_Params>(),
        20usize,
        "Size of NVSDK_NGX_Feature_Create_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_Feature_Create_Params>(),
        4usize,
        "Alignment of NVSDK_NGX_Feature_Create_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InWidth) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_Feature_Create_Params::InWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InHeight) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_Feature_Create_Params::InHeight"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTargetWidth) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_Feature_Create_Params::InTargetWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTargetHeight) as usize - ptr as usize },
        12usize,
        "Offset of field: NVSDK_NGX_Feature_Create_Params::InTargetHeight"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InPerfQualityValue) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_Feature_Create_Params::InPerfQualityValue"
    );
}
impl Default for NVSDK_NGX_Feature_Create_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_DLSS_Create_Params {
    pub Feature: NVSDK_NGX_Feature_Create_Params,
    #[doc = " OPTIONAL"]
    pub InFeatureCreateFlags: ::std::os::raw::c_int,
    pub InEnableOutputSubrects: bool,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_DLSS_Create_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_DLSS_Create_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_DLSS_Create_Params>(),
        28usize,
        "Size of NVSDK_NGX_DLSS_Create_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_DLSS_Create_Params>(),
        4usize,
        "Alignment of NVSDK_NGX_DLSS_Create_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_DLSS_Create_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InFeatureCreateFlags) as usize - ptr as usize },
        20usize,
        "Offset of field: NVSDK_NGX_DLSS_Create_Params::InFeatureCreateFlags"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InEnableOutputSubrects) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_DLSS_Create_Params::InEnableOutputSubrects"
    );
}
impl Default for NVSDK_NGX_DLSS_Create_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_DLDenoise_Create_Params {
    pub Feature: NVSDK_NGX_Feature_Create_Params,
    #[doc = " OPTIONAL"]
    pub InFeatureCreateFlags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_DLDenoise_Create_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_DLDenoise_Create_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_DLDenoise_Create_Params>(),
        24usize,
        "Size of NVSDK_NGX_DLDenoise_Create_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_DLDenoise_Create_Params>(),
        4usize,
        "Alignment of NVSDK_NGX_DLDenoise_Create_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_DLDenoise_Create_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InFeatureCreateFlags) as usize - ptr as usize },
        20usize,
        "Offset of field: NVSDK_NGX_DLDenoise_Create_Params::InFeatureCreateFlags"
    );
}
impl Default for NVSDK_NGX_DLDenoise_Create_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_Parameter {
    _unused: [u8; 0],
}
pub type PFN_NVSDK_NGX_Parameter_SetULL = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: ::std::os::raw::c_ulonglong,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetULL(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: ::std::os::raw::c_ulonglong,
    );
}
pub type PFN_NVSDK_NGX_Parameter_SetF = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: f32,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetF(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: f32,
    );
}
pub type PFN_NVSDK_NGX_Parameter_SetD = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: f64,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetD(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: f64,
    );
}
pub type PFN_NVSDK_NGX_Parameter_SetUI = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: ::std::os::raw::c_uint,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetUI(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: ::std::os::raw::c_uint,
    );
}
pub type PFN_NVSDK_NGX_Parameter_SetI = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: ::std::os::raw::c_int,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetI(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: ::std::os::raw::c_int,
    );
}
pub type PFN_NVSDK_NGX_Parameter_SetD3d11Resource = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: *mut ID3D11Resource,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetD3d11Resource(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: *mut ID3D11Resource,
    );
}
pub type PFN_NVSDK_NGX_Parameter_SetD3d12Resource = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: *mut ID3D12Resource,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetD3d12Resource(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: *mut ID3D12Resource,
    );
}
pub type PFN_NVSDK_NGX_Parameter_SetVoidPointer = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: *mut ::std::os::raw::c_void,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetVoidPointer(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: *mut ::std::os::raw::c_void,
    );
}
pub type PFN_NVSDK_NGX_Parameter_GetULL = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut ::std::os::raw::c_ulonglong,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetULL(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut ::std::os::raw::c_ulonglong,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_Parameter_GetF = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut f32,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetF(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut f32,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_Parameter_GetD = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut f64,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetD(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut f64,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_Parameter_GetUI = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut ::std::os::raw::c_uint,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetUI(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut ::std::os::raw::c_uint,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_Parameter_GetI = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut ::std::os::raw::c_int,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetI(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut ::std::os::raw::c_int,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_Parameter_GetD3d11Resource = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut *mut ID3D11Resource,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetD3d11Resource(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut *mut ID3D11Resource,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_Parameter_GetD3d12Resource = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut *mut ID3D12Resource,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetD3d12Resource(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut *mut ID3D12Resource,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_Parameter_GetVoidPointer = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut *mut ::std::os::raw::c_void,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetVoidPointer(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut *mut ::std::os::raw::c_void,
    ) -> NVSDK_NGX_Result;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IUnknown {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IDXGIAdapter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D11Device {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D11DeviceContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct D3D11_TEXTURE2D_DESC {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct D3D11_BUFFER_DESC {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D11Buffer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D11Texture2D {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D12Device {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D12GraphicsCommandList {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct D3D12_RESOURCE_DESC {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CD3DX12_HEAP_PROPERTIES {
    _unused: [u8; 0],
}
pub type PFN_NVSDK_NGX_D3D12_ResourceAllocCallback = ::std::option::Option<
    unsafe extern "C" fn(
        InDesc: *mut D3D12_RESOURCE_DESC,
        InState: ::std::os::raw::c_int,
        InHeap: *mut CD3DX12_HEAP_PROPERTIES,
        OutResource: *mut *mut ID3D12Resource,
    ),
>;
pub type PFN_NVSDK_NGX_D3D11_BufferAllocCallback = ::std::option::Option<
    unsafe extern "C" fn(InDesc: *mut D3D11_BUFFER_DESC, OutResource: *mut *mut ID3D11Buffer),
>;
pub type PFN_NVSDK_NGX_D3D11_Tex2DAllocCallback = ::std::option::Option<
    unsafe extern "C" fn(InDesc: *mut D3D11_TEXTURE2D_DESC, OutResource: *mut *mut ID3D11Texture2D),
>;
pub type PFN_NVSDK_NGX_ResourceReleaseCallback =
    ::std::option::Option<unsafe extern "C" fn(InResource: *mut IUnknown)>;
pub type CUtexObject = ::std::os::raw::c_ulonglong;
extern "C" {
    pub fn NVSDK_NGX_D3D11_Init(
        InApplicationId: ::std::os::raw::c_ulonglong,
        InApplicationDataPath: *const wchar_t,
        InDevice: *mut ID3D11Device,
        InFeatureInfo: *const NVSDK_NGX_FeatureCommonInfo,
        InSDKVersion: NVSDK_NGX_Version,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_Init(
        InApplicationId: ::std::os::raw::c_ulonglong,
        InApplicationDataPath: *const wchar_t,
        InDevice: *mut ID3D12Device,
        InFeatureInfo: *const NVSDK_NGX_FeatureCommonInfo,
        InSDKVersion: NVSDK_NGX_Version,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_CUDA_Init(
        InApplicationId: ::std::os::raw::c_ulonglong,
        InApplicationDataPath: *const wchar_t,
        InFeatureInfo: *const NVSDK_NGX_FeatureCommonInfo,
        InSDKVersion: NVSDK_NGX_Version,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D11_Init_with_ProjectID(
        InProjectId: *const ::std::os::raw::c_char,
        InEngineType: NVSDK_NGX_EngineType,
        InEngineVersion: *const ::std::os::raw::c_char,
        InApplicationDataPath: *const wchar_t,
        InDevice: *mut ID3D11Device,
        InFeatureInfo: *const NVSDK_NGX_FeatureCommonInfo,
        InSDKVersion: NVSDK_NGX_Version,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_Init_with_ProjectID(
        InProjectId: *const ::std::os::raw::c_char,
        InEngineType: NVSDK_NGX_EngineType,
        InEngineVersion: *const ::std::os::raw::c_char,
        InApplicationDataPath: *const wchar_t,
        InDevice: *mut ID3D12Device,
        InFeatureInfo: *const NVSDK_NGX_FeatureCommonInfo,
        InSDKVersion: NVSDK_NGX_Version,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_CUDA_Init_with_ProjectID(
        InProjectId: *const ::std::os::raw::c_char,
        InEngineType: NVSDK_NGX_EngineType,
        InEngineVersion: *const ::std::os::raw::c_char,
        InApplicationDataPath: *const wchar_t,
        InFeatureInfo: *const NVSDK_NGX_FeatureCommonInfo,
        InSDKVersion: NVSDK_NGX_Version,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D11_Shutdown1(InDevice: *mut ID3D11Device) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_Shutdown1(InDevice: *mut ID3D12Device) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_CUDA_Shutdown() -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D11_AllocateParameters(
        OutParameters: *mut *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_AllocateParameters(
        OutParameters: *mut *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_CUDA_AllocateParameters(
        OutParameters: *mut *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D11_GetCapabilityParameters(
        OutParameters: *mut *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_GetCapabilityParameters(
        OutParameters: *mut *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_CUDA_GetCapabilityParameters(
        OutParameters: *mut *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D11_DestroyParameters(
        InParameters: *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_DestroyParameters(
        InParameters: *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_CUDA_DestroyParameters(
        InParameters: *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D11_GetScratchBufferSize(
        InFeatureId: NVSDK_NGX_Feature,
        InParameters: *const NVSDK_NGX_Parameter,
        OutSizeInBytes: *mut usize,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_GetScratchBufferSize(
        InFeatureId: NVSDK_NGX_Feature,
        InParameters: *const NVSDK_NGX_Parameter,
        OutSizeInBytes: *mut usize,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_CUDA_GetScratchBufferSize(
        InFeatureId: NVSDK_NGX_Feature,
        InParameters: *const NVSDK_NGX_Parameter,
        OutSizeInBytes: *mut usize,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D11_CreateFeature(
        InDevCtx: *mut ID3D11DeviceContext,
        InFeatureID: NVSDK_NGX_Feature,
        InParameters: *mut NVSDK_NGX_Parameter,
        OutHandle: *mut *mut NVSDK_NGX_Handle,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_CreateFeature(
        InCmdList: *mut ID3D12GraphicsCommandList,
        InFeatureID: NVSDK_NGX_Feature,
        InParameters: *mut NVSDK_NGX_Parameter,
        OutHandle: *mut *mut NVSDK_NGX_Handle,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_CUDA_CreateFeature(
        InFeatureID: NVSDK_NGX_Feature,
        InParameters: *const NVSDK_NGX_Parameter,
        OutHandle: *mut *mut NVSDK_NGX_Handle,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D11_ReleaseFeature(InHandle: *mut NVSDK_NGX_Handle) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_ReleaseFeature(InHandle: *mut NVSDK_NGX_Handle) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_CUDA_ReleaseFeature(InHandle: *mut NVSDK_NGX_Handle) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D11_GetFeatureRequirements(
        Adapter: *mut IDXGIAdapter,
        FeatureDiscoveryInfo: *const NVSDK_NGX_FeatureDiscoveryInfo,
        OutSupported: *mut NVSDK_NGX_FeatureRequirement,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_GetFeatureRequirements(
        Adapter: *mut IDXGIAdapter,
        FeatureDiscoveryInfo: *const NVSDK_NGX_FeatureDiscoveryInfo,
        OutSupported: *mut NVSDK_NGX_FeatureRequirement,
    ) -> NVSDK_NGX_Result;
}
pub type PFN_NVSDK_NGX_ProgressCallback_C =
    ::std::option::Option<unsafe extern "C" fn(InCurrentProgress: f32, OutShouldCancel: *mut bool)>;
extern "C" {
    pub fn NVSDK_NGX_D3D11_EvaluateFeature_C(
        InDevCtx: *mut ID3D11DeviceContext,
        InFeatureHandle: *const NVSDK_NGX_Handle,
        InParameters: *const NVSDK_NGX_Parameter,
        InCallback: PFN_NVSDK_NGX_ProgressCallback_C,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_EvaluateFeature_C(
        InCmdList: *mut ID3D12GraphicsCommandList,
        InFeatureHandle: *const NVSDK_NGX_Handle,
        InParameters: *const NVSDK_NGX_Parameter,
        InCallback: PFN_NVSDK_NGX_ProgressCallback_C,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_CUDA_EvaluateFeature_C(
        InFeatureHandle: *const NVSDK_NGX_Handle,
        InParameters: *const NVSDK_NGX_Parameter,
        InCallback: PFN_NVSDK_NGX_ProgressCallback_C,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_UpdateFeature(
        ApplicationId: *const NVSDK_NGX_Application_Identifier,
        FeatureID: NVSDK_NGX_Feature,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn GetNGXResultAsString(InNGXResult: NVSDK_NGX_Result) -> *const wchar_t;
}
pub type PFN_NVSDK_NGX_DLSS_GetStatsCallback = ::std::option::Option<
    unsafe extern "C" fn(InParams: *mut NVSDK_NGX_Parameter) -> NVSDK_NGX_Result,
>;
pub type PFN_NVSDK_NGX_DLSS_GetOptimalSettingsCallback = ::std::option::Option<
    unsafe extern "C" fn(InParams: *mut NVSDK_NGX_Parameter) -> NVSDK_NGX_Result,
>;
#[doc = " D3D11"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_D3D11_Feature_Eval_Params {
    pub pInColor: *mut ID3D11Resource,
    pub pInOutput: *mut ID3D11Resource,
    #[doc = " OPTIONAL for DLSS"]
    pub InSharpness: f32,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_D3D11_Feature_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_D3D11_Feature_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_D3D11_Feature_Eval_Params>(),
        24usize,
        "Size of NVSDK_NGX_D3D11_Feature_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_D3D11_Feature_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_D3D11_Feature_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColor) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_D3D11_Feature_Eval_Params::pInColor"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInOutput) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_D3D11_Feature_Eval_Params::pInOutput"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InSharpness) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_D3D11_Feature_Eval_Params::InSharpness"
    );
}
impl Default for NVSDK_NGX_D3D11_Feature_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_CUDA_Feature_Eval_Params {
    pub pInColor: *mut CUtexObject,
    pub pInOutput: *mut CUtexObject,
    #[doc = " OPTIONAL for DLSS"]
    pub InSharpness: f32,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_CUDA_Feature_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_CUDA_Feature_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_CUDA_Feature_Eval_Params>(),
        24usize,
        "Size of NVSDK_NGX_CUDA_Feature_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_CUDA_Feature_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_CUDA_Feature_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColor) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_CUDA_Feature_Eval_Params::pInColor"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInOutput) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_CUDA_Feature_Eval_Params::pInOutput"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InSharpness) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_CUDA_Feature_Eval_Params::InSharpness"
    );
}
impl Default for NVSDK_NGX_CUDA_Feature_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_D3D11_GBuffer {
    pub pInAttrib: [*mut ID3D11Resource; 16usize],
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_D3D11_GBuffer() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_D3D11_GBuffer> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_D3D11_GBuffer>(),
        128usize,
        "Size of NVSDK_NGX_D3D11_GBuffer"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_D3D11_GBuffer>(),
        8usize,
        "Alignment of NVSDK_NGX_D3D11_GBuffer"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInAttrib) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_D3D11_GBuffer::pInAttrib"
    );
}
impl Default for NVSDK_NGX_D3D11_GBuffer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_D3D11_DLSS_Eval_Params {
    pub Feature: NVSDK_NGX_D3D11_Feature_Eval_Params,
    pub pInDepth: *mut ID3D11Resource,
    pub pInMotionVectors: *mut ID3D11Resource,
    pub InJitterOffsetX: f32,
    pub InJitterOffsetY: f32,
    pub InRenderSubrectDimensions: NVSDK_NGX_Dimensions,
    #[doc = " OPTIONAL - leave to 0/0.0f if unused"]
    pub InReset: ::std::os::raw::c_int,
    pub InMVScaleX: f32,
    pub InMVScaleY: f32,
    pub pInTransparencyMask: *mut ID3D11Resource,
    pub pInExposureTexture: *mut ID3D11Resource,
    pub pInBiasCurrentColorMask: *mut ID3D11Resource,
    pub InColorSubrectBase: NVSDK_NGX_Coordinates,
    pub InDepthSubrectBase: NVSDK_NGX_Coordinates,
    pub InMVSubrectBase: NVSDK_NGX_Coordinates,
    pub InTranslucencySubrectBase: NVSDK_NGX_Coordinates,
    pub InBiasCurrentColorSubrectBase: NVSDK_NGX_Coordinates,
    pub InOutputSubrectBase: NVSDK_NGX_Coordinates,
    pub InPreExposure: f32,
    pub InExposureScale: f32,
    pub InIndicatorInvertXAxis: ::std::os::raw::c_int,
    pub InIndicatorInvertYAxis: ::std::os::raw::c_int,
    #[doc = " OPTIONAL - only for research purposes"]
    pub GBufferSurface: NVSDK_NGX_D3D11_GBuffer,
    pub InToneMapperType: NVSDK_NGX_ToneMapperType,
    pub pInMotionVectors3D: *mut ID3D11Resource,
    pub pInIsParticleMask: *mut ID3D11Resource,
    pub pInAnimatedTextureMask: *mut ID3D11Resource,
    pub pInDepthHighRes: *mut ID3D11Resource,
    pub pInPositionViewSpace: *mut ID3D11Resource,
    pub InFrameTimeDeltaInMsec: f32,
    pub pInRayTracingHitDistance: *mut ID3D11Resource,
    pub pInMotionVectorsReflections: *mut ID3D11Resource,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_D3D11_DLSS_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_D3D11_DLSS_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_D3D11_DLSS_Eval_Params>(),
        360usize,
        "Size of NVSDK_NGX_D3D11_DLSS_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_D3D11_DLSS_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_D3D11_DLSS_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDepth) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::pInDepth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectors) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::pInMotionVectors"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InJitterOffsetX) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InJitterOffsetX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InJitterOffsetY) as usize - ptr as usize },
        44usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InJitterOffsetY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRenderSubrectDimensions) as usize - ptr as usize },
        48usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InRenderSubrectDimensions"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InReset) as usize - ptr as usize },
        56usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InReset"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVScaleX) as usize - ptr as usize },
        60usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InMVScaleX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVScaleY) as usize - ptr as usize },
        64usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InMVScaleY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInTransparencyMask) as usize - ptr as usize },
        72usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::pInTransparencyMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInExposureTexture) as usize - ptr as usize },
        80usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::pInExposureTexture"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInBiasCurrentColorMask) as usize - ptr as usize },
        88usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::pInBiasCurrentColorMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InColorSubrectBase) as usize - ptr as usize },
        96usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InColorSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDepthSubrectBase) as usize - ptr as usize },
        104usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InDepthSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVSubrectBase) as usize - ptr as usize },
        112usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InMVSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTranslucencySubrectBase) as usize - ptr as usize },
        120usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InTranslucencySubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InBiasCurrentColorSubrectBase) as usize - ptr as usize
        },
        128usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InBiasCurrentColorSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InOutputSubrectBase) as usize - ptr as usize },
        136usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InOutputSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InPreExposure) as usize - ptr as usize },
        144usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InPreExposure"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InExposureScale) as usize - ptr as usize },
        148usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InExposureScale"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InIndicatorInvertXAxis) as usize - ptr as usize },
        152usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InIndicatorInvertXAxis"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InIndicatorInvertYAxis) as usize - ptr as usize },
        156usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InIndicatorInvertYAxis"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GBufferSurface) as usize - ptr as usize },
        160usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::GBufferSurface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InToneMapperType) as usize - ptr as usize },
        288usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InToneMapperType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectors3D) as usize - ptr as usize },
        296usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::pInMotionVectors3D"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInIsParticleMask) as usize - ptr as usize },
        304usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::pInIsParticleMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInAnimatedTextureMask) as usize - ptr as usize },
        312usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::pInAnimatedTextureMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDepthHighRes) as usize - ptr as usize },
        320usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::pInDepthHighRes"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInPositionViewSpace) as usize - ptr as usize },
        328usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::pInPositionViewSpace"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InFrameTimeDeltaInMsec) as usize - ptr as usize },
        336usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::InFrameTimeDeltaInMsec"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInRayTracingHitDistance) as usize - ptr as usize },
        344usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::pInRayTracingHitDistance"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectorsReflections) as usize - ptr as usize },
        352usize,
        "Offset of field: NVSDK_NGX_D3D11_DLSS_Eval_Params::pInMotionVectorsReflections"
    );
}
impl Default for NVSDK_NGX_D3D11_DLSS_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_D3D11_DLISP_Eval_Params {
    pub Feature: NVSDK_NGX_D3D11_Feature_Eval_Params,
    #[doc = " OPTIONAL - leave to 0/0.0f if unused"]
    pub InRectX: ::std::os::raw::c_uint,
    pub InRectY: ::std::os::raw::c_uint,
    pub InRectW: ::std::os::raw::c_uint,
    pub InRectH: ::std::os::raw::c_uint,
    pub InDenoise: f32,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_D3D11_DLISP_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_D3D11_DLISP_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_D3D11_DLISP_Eval_Params>(),
        48usize,
        "Size of NVSDK_NGX_D3D11_DLISP_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_D3D11_DLISP_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_D3D11_DLISP_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_D3D11_DLISP_Eval_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectX) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_D3D11_DLISP_Eval_Params::InRectX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectY) as usize - ptr as usize },
        28usize,
        "Offset of field: NVSDK_NGX_D3D11_DLISP_Eval_Params::InRectY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectW) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_D3D11_DLISP_Eval_Params::InRectW"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectH) as usize - ptr as usize },
        36usize,
        "Offset of field: NVSDK_NGX_D3D11_DLISP_Eval_Params::InRectH"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDenoise) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_D3D11_DLISP_Eval_Params::InDenoise"
    );
}
impl Default for NVSDK_NGX_D3D11_DLISP_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_CUDA_DLISP_Eval_Params {
    pub Feature: NVSDK_NGX_CUDA_Feature_Eval_Params,
    #[doc = " OPTIONAL - leave to 0/0.0f if unused"]
    pub InRectX: ::std::os::raw::c_uint,
    pub InRectY: ::std::os::raw::c_uint,
    pub InRectW: ::std::os::raw::c_uint,
    pub InRectH: ::std::os::raw::c_uint,
    pub InDenoise: f32,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_CUDA_DLISP_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_CUDA_DLISP_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_CUDA_DLISP_Eval_Params>(),
        48usize,
        "Size of NVSDK_NGX_CUDA_DLISP_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_CUDA_DLISP_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_CUDA_DLISP_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_CUDA_DLISP_Eval_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectX) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_CUDA_DLISP_Eval_Params::InRectX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectY) as usize - ptr as usize },
        28usize,
        "Offset of field: NVSDK_NGX_CUDA_DLISP_Eval_Params::InRectY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectW) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_CUDA_DLISP_Eval_Params::InRectW"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectH) as usize - ptr as usize },
        36usize,
        "Offset of field: NVSDK_NGX_CUDA_DLISP_Eval_Params::InRectH"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDenoise) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_CUDA_DLISP_Eval_Params::InDenoise"
    );
}
impl Default for NVSDK_NGX_CUDA_DLISP_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[doc = " D3D12"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_D3D12_Feature_Eval_Params {
    pub pInColor: *mut ID3D12Resource,
    pub pInOutput: *mut ID3D12Resource,
    #[doc = " OPTIONAL for DLSS"]
    pub InSharpness: f32,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_D3D12_Feature_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_D3D12_Feature_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_D3D12_Feature_Eval_Params>(),
        24usize,
        "Size of NVSDK_NGX_D3D12_Feature_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_D3D12_Feature_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_D3D12_Feature_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColor) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_D3D12_Feature_Eval_Params::pInColor"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInOutput) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_D3D12_Feature_Eval_Params::pInOutput"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InSharpness) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_D3D12_Feature_Eval_Params::InSharpness"
    );
}
impl Default for NVSDK_NGX_D3D12_Feature_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_D3D12_GBuffer {
    pub pInAttrib: [*mut ID3D12Resource; 16usize],
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_D3D12_GBuffer() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_D3D12_GBuffer> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_D3D12_GBuffer>(),
        128usize,
        "Size of NVSDK_NGX_D3D12_GBuffer"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_D3D12_GBuffer>(),
        8usize,
        "Alignment of NVSDK_NGX_D3D12_GBuffer"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInAttrib) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_D3D12_GBuffer::pInAttrib"
    );
}
impl Default for NVSDK_NGX_D3D12_GBuffer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_D3D12_DLSS_Eval_Params {
    pub Feature: NVSDK_NGX_D3D12_Feature_Eval_Params,
    pub pInDepth: *mut ID3D12Resource,
    pub pInMotionVectors: *mut ID3D12Resource,
    pub InJitterOffsetX: f32,
    pub InJitterOffsetY: f32,
    pub InRenderSubrectDimensions: NVSDK_NGX_Dimensions,
    #[doc = " OPTIONAL - leave to 0/0.0f if unused"]
    pub InReset: ::std::os::raw::c_int,
    pub InMVScaleX: f32,
    pub InMVScaleY: f32,
    pub pInTransparencyMask: *mut ID3D12Resource,
    pub pInExposureTexture: *mut ID3D12Resource,
    pub pInBiasCurrentColorMask: *mut ID3D12Resource,
    pub InColorSubrectBase: NVSDK_NGX_Coordinates,
    pub InDepthSubrectBase: NVSDK_NGX_Coordinates,
    pub InMVSubrectBase: NVSDK_NGX_Coordinates,
    pub InTranslucencySubrectBase: NVSDK_NGX_Coordinates,
    pub InBiasCurrentColorSubrectBase: NVSDK_NGX_Coordinates,
    pub InOutputSubrectBase: NVSDK_NGX_Coordinates,
    pub InPreExposure: f32,
    pub InExposureScale: f32,
    pub InIndicatorInvertXAxis: ::std::os::raw::c_int,
    pub InIndicatorInvertYAxis: ::std::os::raw::c_int,
    #[doc = " OPTIONAL - only for research purposes"]
    pub GBufferSurface: NVSDK_NGX_D3D12_GBuffer,
    pub InToneMapperType: NVSDK_NGX_ToneMapperType,
    pub pInMotionVectors3D: *mut ID3D12Resource,
    pub pInIsParticleMask: *mut ID3D12Resource,
    pub pInAnimatedTextureMask: *mut ID3D12Resource,
    pub pInDepthHighRes: *mut ID3D12Resource,
    pub pInPositionViewSpace: *mut ID3D12Resource,
    pub InFrameTimeDeltaInMsec: f32,
    pub pInRayTracingHitDistance: *mut ID3D12Resource,
    pub pInMotionVectorsReflections: *mut ID3D12Resource,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_D3D12_DLSS_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_D3D12_DLSS_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_D3D12_DLSS_Eval_Params>(),
        360usize,
        "Size of NVSDK_NGX_D3D12_DLSS_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_D3D12_DLSS_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_D3D12_DLSS_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDepth) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInDepth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectors) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInMotionVectors"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InJitterOffsetX) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InJitterOffsetX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InJitterOffsetY) as usize - ptr as usize },
        44usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InJitterOffsetY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRenderSubrectDimensions) as usize - ptr as usize },
        48usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InRenderSubrectDimensions"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InReset) as usize - ptr as usize },
        56usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InReset"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVScaleX) as usize - ptr as usize },
        60usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InMVScaleX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVScaleY) as usize - ptr as usize },
        64usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InMVScaleY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInTransparencyMask) as usize - ptr as usize },
        72usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInTransparencyMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInExposureTexture) as usize - ptr as usize },
        80usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInExposureTexture"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInBiasCurrentColorMask) as usize - ptr as usize },
        88usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInBiasCurrentColorMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InColorSubrectBase) as usize - ptr as usize },
        96usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InColorSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDepthSubrectBase) as usize - ptr as usize },
        104usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InDepthSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVSubrectBase) as usize - ptr as usize },
        112usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InMVSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTranslucencySubrectBase) as usize - ptr as usize },
        120usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InTranslucencySubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InBiasCurrentColorSubrectBase) as usize - ptr as usize
        },
        128usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InBiasCurrentColorSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InOutputSubrectBase) as usize - ptr as usize },
        136usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InOutputSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InPreExposure) as usize - ptr as usize },
        144usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InPreExposure"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InExposureScale) as usize - ptr as usize },
        148usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InExposureScale"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InIndicatorInvertXAxis) as usize - ptr as usize },
        152usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InIndicatorInvertXAxis"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InIndicatorInvertYAxis) as usize - ptr as usize },
        156usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InIndicatorInvertYAxis"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GBufferSurface) as usize - ptr as usize },
        160usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::GBufferSurface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InToneMapperType) as usize - ptr as usize },
        288usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InToneMapperType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectors3D) as usize - ptr as usize },
        296usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInMotionVectors3D"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInIsParticleMask) as usize - ptr as usize },
        304usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInIsParticleMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInAnimatedTextureMask) as usize - ptr as usize },
        312usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInAnimatedTextureMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDepthHighRes) as usize - ptr as usize },
        320usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInDepthHighRes"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInPositionViewSpace) as usize - ptr as usize },
        328usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInPositionViewSpace"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InFrameTimeDeltaInMsec) as usize - ptr as usize },
        336usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InFrameTimeDeltaInMsec"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInRayTracingHitDistance) as usize - ptr as usize },
        344usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInRayTracingHitDistance"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectorsReflections) as usize - ptr as usize },
        352usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInMotionVectorsReflections"
    );
}
impl Default for NVSDK_NGX_D3D12_DLSS_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_D3D12_DLISP_Eval_Params {
    pub Feature: NVSDK_NGX_D3D12_Feature_Eval_Params,
    #[doc = " OPTIONAL"]
    pub InRectX: ::std::os::raw::c_uint,
    pub InRectY: ::std::os::raw::c_uint,
    pub InRectW: ::std::os::raw::c_uint,
    pub InRectH: ::std::os::raw::c_uint,
    pub InDenoise: f32,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_D3D12_DLISP_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_D3D12_DLISP_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_D3D12_DLISP_Eval_Params>(),
        48usize,
        "Size of NVSDK_NGX_D3D12_DLISP_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_D3D12_DLISP_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_D3D12_DLISP_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_D3D12_DLISP_Eval_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectX) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_D3D12_DLISP_Eval_Params::InRectX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectY) as usize - ptr as usize },
        28usize,
        "Offset of field: NVSDK_NGX_D3D12_DLISP_Eval_Params::InRectY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectW) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_D3D12_DLISP_Eval_Params::InRectW"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectH) as usize - ptr as usize },
        36usize,
        "Offset of field: NVSDK_NGX_D3D12_DLISP_Eval_Params::InRectH"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDenoise) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_D3D12_DLISP_Eval_Params::InDenoise"
    );
}
impl Default for NVSDK_NGX_D3D12_DLISP_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_DLSS_Denoise_Mode {
    NVSDK_NGX_DLSS_Denoise_Mode_Off = 0,
    NVSDK_NGX_DLSS_Denoise_Mode_DLUnified = 1,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_DLSS_Roughness_Mode {
    NVSDK_NGX_DLSS_Roughness_Mode_Unpacked = 0,
    NVSDK_NGX_DLSS_Roughness_Mode_Packed = 1,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_DLSS_Depth_Type {
    NVSDK_NGX_DLSS_Depth_Type_Linear = 0,
    NVSDK_NGX_DLSS_Depth_Type_HW = 1,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum NVSDK_NGX_RayReconstruction_Hint_Render_Preset {
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_Default = 0,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_A = 1,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_B = 2,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_C = 3,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_D = 4,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_E = 5,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_F = 6,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_G = 7,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_H = 8,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_I = 9,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_J = 10,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_K = 11,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_L = 12,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_M = 13,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_N = 14,
    NVSDK_NGX_RayReconstruction_Hint_Render_Preset_O = 15,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_DLSSD_Create_Params {
    pub InDenoiseMode: NVSDK_NGX_DLSS_Denoise_Mode,
    pub InRoughnessMode: NVSDK_NGX_DLSS_Roughness_Mode,
    pub InUseHWDepth: NVSDK_NGX_DLSS_Depth_Type,
    pub InWidth: ::std::os::raw::c_uint,
    pub InHeight: ::std::os::raw::c_uint,
    pub InTargetWidth: ::std::os::raw::c_uint,
    pub InTargetHeight: ::std::os::raw::c_uint,
    #[doc = " OPTIONAL"]
    pub InPerfQualityValue: NVSDK_NGX_PerfQuality_Value,
    pub InFeatureCreateFlags: ::std::os::raw::c_int,
    pub InEnableOutputSubrects: bool,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_DLSSD_Create_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_DLSSD_Create_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_DLSSD_Create_Params>(),
        40usize,
        "Size of NVSDK_NGX_DLSSD_Create_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_DLSSD_Create_Params>(),
        4usize,
        "Alignment of NVSDK_NGX_DLSSD_Create_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDenoiseMode) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InDenoiseMode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRoughnessMode) as usize - ptr as usize },
        4usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InRoughnessMode"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InUseHWDepth) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InUseHWDepth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InWidth) as usize - ptr as usize },
        12usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InHeight) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InHeight"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTargetWidth) as usize - ptr as usize },
        20usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InTargetWidth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTargetHeight) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InTargetHeight"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InPerfQualityValue) as usize - ptr as usize },
        28usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InPerfQualityValue"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InFeatureCreateFlags) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InFeatureCreateFlags"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InEnableOutputSubrects) as usize - ptr as usize },
        36usize,
        "Offset of field: NVSDK_NGX_DLSSD_Create_Params::InEnableOutputSubrects"
    );
}
impl Default for NVSDK_NGX_DLSSD_Create_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __crt_locale_data {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __crt_multibyte_data {
    pub _address: u8,
}
