/* automatically generated by rust-bindgen 0.72.0 */

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D12Resource {
    _unused: [u8; 0],
}
pub type PFN_NVSDK_NGX_Parameter_SetD3d12Resource = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: *mut ID3D12Resource,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_SetD3d12Resource(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        InValue: *mut ID3D12Resource,
    );
}
pub type PFN_NVSDK_NGX_Parameter_GetD3d12Resource = ::std::option::Option<
    unsafe extern "C" fn(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut *mut ID3D12Resource,
    ) -> NVSDK_NGX_Result,
>;
extern "C" {
    pub fn NVSDK_NGX_Parameter_GetD3d12Resource(
        InParameter: *mut NVSDK_NGX_Parameter,
        InName: *const ::std::os::raw::c_char,
        OutValue: *mut *mut ID3D12Resource,
    ) -> NVSDK_NGX_Result;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D12Device {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ID3D12GraphicsCommandList {
    _unused: [u8; 0],
}
pub type PFN_NVSDK_NGX_D3D12_ResourceAllocCallback = ::std::option::Option<
    unsafe extern "C" fn(
        InDesc: *mut D3D12_RESOURCE_DESC,
        InState: ::std::os::raw::c_int,
        InHeap: *mut CD3DX12_HEAP_PROPERTIES,
        OutResource: *mut *mut ID3D12Resource,
    ),
>;
extern "C" {
    pub fn NVSDK_NGX_D3D12_Init(
        InApplicationId: ::std::os::raw::c_ulonglong,
        InApplicationDataPath: *const wchar_t,
        InDevice: *mut ID3D12Device,
        InFeatureInfo: *const NVSDK_NGX_FeatureCommonInfo,
        InSDKVersion: NVSDK_NGX_Version,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_Init_with_ProjectID(
        InProjectId: *const ::std::os::raw::c_char,
        InEngineType: NVSDK_NGX_EngineType,
        InEngineVersion: *const ::std::os::raw::c_char,
        InApplicationDataPath: *const wchar_t,
        InDevice: *mut ID3D12Device,
        InFeatureInfo: *const NVSDK_NGX_FeatureCommonInfo,
        InSDKVersion: NVSDK_NGX_Version,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_Shutdown1(InDevice: *mut ID3D12Device) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_AllocateParameters(
        OutParameters: *mut *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_GetCapabilityParameters(
        OutParameters: *mut *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_DestroyParameters(
        InParameters: *mut NVSDK_NGX_Parameter,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_GetScratchBufferSize(
        InFeatureId: NVSDK_NGX_Feature,
        InParameters: *const NVSDK_NGX_Parameter,
        OutSizeInBytes: *mut usize,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_CreateFeature(
        InCmdList: *mut ID3D12GraphicsCommandList,
        InFeatureID: NVSDK_NGX_Feature,
        InParameters: *mut NVSDK_NGX_Parameter,
        OutHandle: *mut *mut NVSDK_NGX_Handle,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_ReleaseFeature(InHandle: *mut NVSDK_NGX_Handle) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_GetFeatureRequirements(
        Adapter: *mut IDXGIAdapter,
        FeatureDiscoveryInfo: *const NVSDK_NGX_FeatureDiscoveryInfo,
        OutSupported: *mut NVSDK_NGX_FeatureRequirement,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn NVSDK_NGX_D3D12_EvaluateFeature_C(
        InCmdList: *mut ID3D12GraphicsCommandList,
        InFeatureHandle: *const NVSDK_NGX_Handle,
        InParameters: *const NVSDK_NGX_Parameter,
        InCallback: PFN_NVSDK_NGX_ProgressCallback_C,
    ) -> NVSDK_NGX_Result;
}
#[doc = " D3D12"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_D3D12_Feature_Eval_Params {
    pub pInColor: *mut ID3D12Resource,
    pub pInOutput: *mut ID3D12Resource,
    #[doc = " OPTIONAL for DLSS"]
    pub InSharpness: f32,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_D3D12_Feature_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_D3D12_Feature_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_D3D12_Feature_Eval_Params>(),
        24usize,
        "Size of NVSDK_NGX_D3D12_Feature_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_D3D12_Feature_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_D3D12_Feature_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInColor) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_D3D12_Feature_Eval_Params::pInColor"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInOutput) as usize - ptr as usize },
        8usize,
        "Offset of field: NVSDK_NGX_D3D12_Feature_Eval_Params::pInOutput"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InSharpness) as usize - ptr as usize },
        16usize,
        "Offset of field: NVSDK_NGX_D3D12_Feature_Eval_Params::InSharpness"
    );
}
impl Default for NVSDK_NGX_D3D12_Feature_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_D3D12_GBuffer {
    pub pInAttrib: [*mut ID3D12Resource; 16usize],
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_D3D12_GBuffer() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_D3D12_GBuffer> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_D3D12_GBuffer>(),
        128usize,
        "Size of NVSDK_NGX_D3D12_GBuffer"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_D3D12_GBuffer>(),
        8usize,
        "Alignment of NVSDK_NGX_D3D12_GBuffer"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInAttrib) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_D3D12_GBuffer::pInAttrib"
    );
}
impl Default for NVSDK_NGX_D3D12_GBuffer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct NVSDK_NGX_D3D12_DLSS_Eval_Params {
    pub Feature: NVSDK_NGX_D3D12_Feature_Eval_Params,
    pub pInDepth: *mut ID3D12Resource,
    pub pInMotionVectors: *mut ID3D12Resource,
    pub InJitterOffsetX: f32,
    pub InJitterOffsetY: f32,
    pub InRenderSubrectDimensions: NVSDK_NGX_Dimensions,
    #[doc = " OPTIONAL - leave to 0/0.0f if unused"]
    pub InReset: ::std::os::raw::c_int,
    pub InMVScaleX: f32,
    pub InMVScaleY: f32,
    pub pInTransparencyMask: *mut ID3D12Resource,
    pub pInExposureTexture: *mut ID3D12Resource,
    pub pInBiasCurrentColorMask: *mut ID3D12Resource,
    pub InColorSubrectBase: NVSDK_NGX_Coordinates,
    pub InDepthSubrectBase: NVSDK_NGX_Coordinates,
    pub InMVSubrectBase: NVSDK_NGX_Coordinates,
    pub InTranslucencySubrectBase: NVSDK_NGX_Coordinates,
    pub InBiasCurrentColorSubrectBase: NVSDK_NGX_Coordinates,
    pub InOutputSubrectBase: NVSDK_NGX_Coordinates,
    pub InPreExposure: f32,
    pub InExposureScale: f32,
    pub InIndicatorInvertXAxis: ::std::os::raw::c_int,
    pub InIndicatorInvertYAxis: ::std::os::raw::c_int,
    #[doc = " OPTIONAL - only for research purposes"]
    pub GBufferSurface: NVSDK_NGX_D3D12_GBuffer,
    pub InToneMapperType: NVSDK_NGX_ToneMapperType,
    pub pInMotionVectors3D: *mut ID3D12Resource,
    pub pInIsParticleMask: *mut ID3D12Resource,
    pub pInAnimatedTextureMask: *mut ID3D12Resource,
    pub pInDepthHighRes: *mut ID3D12Resource,
    pub pInPositionViewSpace: *mut ID3D12Resource,
    pub InFrameTimeDeltaInMsec: f32,
    pub pInRayTracingHitDistance: *mut ID3D12Resource,
    pub pInMotionVectorsReflections: *mut ID3D12Resource,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_D3D12_DLSS_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_D3D12_DLSS_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_D3D12_DLSS_Eval_Params>(),
        360usize,
        "Size of NVSDK_NGX_D3D12_DLSS_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_D3D12_DLSS_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_D3D12_DLSS_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDepth) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInDepth"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectors) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInMotionVectors"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InJitterOffsetX) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InJitterOffsetX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InJitterOffsetY) as usize - ptr as usize },
        44usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InJitterOffsetY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRenderSubrectDimensions) as usize - ptr as usize },
        48usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InRenderSubrectDimensions"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InReset) as usize - ptr as usize },
        56usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InReset"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVScaleX) as usize - ptr as usize },
        60usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InMVScaleX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVScaleY) as usize - ptr as usize },
        64usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InMVScaleY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInTransparencyMask) as usize - ptr as usize },
        72usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInTransparencyMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInExposureTexture) as usize - ptr as usize },
        80usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInExposureTexture"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInBiasCurrentColorMask) as usize - ptr as usize },
        88usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInBiasCurrentColorMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InColorSubrectBase) as usize - ptr as usize },
        96usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InColorSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDepthSubrectBase) as usize - ptr as usize },
        104usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InDepthSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InMVSubrectBase) as usize - ptr as usize },
        112usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InMVSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InTranslucencySubrectBase) as usize - ptr as usize },
        120usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InTranslucencySubrectBase"
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).InBiasCurrentColorSubrectBase) as usize - ptr as usize
        },
        128usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InBiasCurrentColorSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InOutputSubrectBase) as usize - ptr as usize },
        136usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InOutputSubrectBase"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InPreExposure) as usize - ptr as usize },
        144usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InPreExposure"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InExposureScale) as usize - ptr as usize },
        148usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InExposureScale"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InIndicatorInvertXAxis) as usize - ptr as usize },
        152usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InIndicatorInvertXAxis"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InIndicatorInvertYAxis) as usize - ptr as usize },
        156usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InIndicatorInvertYAxis"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).GBufferSurface) as usize - ptr as usize },
        160usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::GBufferSurface"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InToneMapperType) as usize - ptr as usize },
        288usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InToneMapperType"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectors3D) as usize - ptr as usize },
        296usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInMotionVectors3D"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInIsParticleMask) as usize - ptr as usize },
        304usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInIsParticleMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInAnimatedTextureMask) as usize - ptr as usize },
        312usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInAnimatedTextureMask"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInDepthHighRes) as usize - ptr as usize },
        320usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInDepthHighRes"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInPositionViewSpace) as usize - ptr as usize },
        328usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInPositionViewSpace"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InFrameTimeDeltaInMsec) as usize - ptr as usize },
        336usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::InFrameTimeDeltaInMsec"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInRayTracingHitDistance) as usize - ptr as usize },
        344usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInRayTracingHitDistance"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pInMotionVectorsReflections) as usize - ptr as usize },
        352usize,
        "Offset of field: NVSDK_NGX_D3D12_DLSS_Eval_Params::pInMotionVectorsReflections"
    );
}
impl Default for NVSDK_NGX_D3D12_DLSS_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl ::std::fmt::Debug for NVSDK_NGX_D3D12_DLSS_Eval_Params {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! (f , "NVSDK_NGX_D3D12_DLSS_Eval_Params {{ Feature: {:?}, pInDepth: {:?}, pInMotionVectors: {:?}, InJitterOffsetX: {:?}, InJitterOffsetY: {:?}, InReset: {:?}, InMVScaleX: {:?}, InMVScaleY: {:?}, pInTransparencyMask: {:?}, pInExposureTexture: {:?}, pInBiasCurrentColorMask: {:?}, InPreExposure: {:?}, InExposureScale: {:?}, InIndicatorInvertXAxis: {:?}, InIndicatorInvertYAxis: {:?}, GBufferSurface: {:?}, pInMotionVectors3D: {:?}, pInIsParticleMask: {:?}, pInAnimatedTextureMask: {:?}, pInDepthHighRes: {:?}, pInPositionViewSpace: {:?}, InFrameTimeDeltaInMsec: {:?}, pInRayTracingHitDistance: {:?}, pInMotionVectorsReflections: {:?} }}" , self . Feature , self . pInDepth , self . pInMotionVectors , self . InJitterOffsetX , self . InJitterOffsetY , self . InReset , self . InMVScaleX , self . InMVScaleY , self . pInTransparencyMask , self . pInExposureTexture , self . pInBiasCurrentColorMask , self . InPreExposure , self . InExposureScale , self . InIndicatorInvertXAxis , self . InIndicatorInvertYAxis , self . GBufferSurface , self . pInMotionVectors3D , self . pInIsParticleMask , self . pInAnimatedTextureMask , self . pInDepthHighRes , self . pInPositionViewSpace , self . InFrameTimeDeltaInMsec , self . pInRayTracingHitDistance , self . pInMotionVectorsReflections)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NVSDK_NGX_D3D12_DLISP_Eval_Params {
    pub Feature: NVSDK_NGX_D3D12_Feature_Eval_Params,
    #[doc = " OPTIONAL"]
    pub InRectX: ::std::os::raw::c_uint,
    pub InRectY: ::std::os::raw::c_uint,
    pub InRectW: ::std::os::raw::c_uint,
    pub InRectH: ::std::os::raw::c_uint,
    pub InDenoise: f32,
}
#[test]
fn bindgen_test_layout_NVSDK_NGX_D3D12_DLISP_Eval_Params() {
    const UNINIT: ::std::mem::MaybeUninit<NVSDK_NGX_D3D12_DLISP_Eval_Params> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<NVSDK_NGX_D3D12_DLISP_Eval_Params>(),
        48usize,
        "Size of NVSDK_NGX_D3D12_DLISP_Eval_Params"
    );
    assert_eq!(
        ::std::mem::align_of::<NVSDK_NGX_D3D12_DLISP_Eval_Params>(),
        8usize,
        "Alignment of NVSDK_NGX_D3D12_DLISP_Eval_Params"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Feature) as usize - ptr as usize },
        0usize,
        "Offset of field: NVSDK_NGX_D3D12_DLISP_Eval_Params::Feature"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectX) as usize - ptr as usize },
        24usize,
        "Offset of field: NVSDK_NGX_D3D12_DLISP_Eval_Params::InRectX"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectY) as usize - ptr as usize },
        28usize,
        "Offset of field: NVSDK_NGX_D3D12_DLISP_Eval_Params::InRectY"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectW) as usize - ptr as usize },
        32usize,
        "Offset of field: NVSDK_NGX_D3D12_DLISP_Eval_Params::InRectW"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InRectH) as usize - ptr as usize },
        36usize,
        "Offset of field: NVSDK_NGX_D3D12_DLISP_Eval_Params::InRectH"
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).InDenoise) as usize - ptr as usize },
        40usize,
        "Offset of field: NVSDK_NGX_D3D12_DLISP_Eval_Params::InDenoise"
    );
}
impl Default for NVSDK_NGX_D3D12_DLISP_Eval_Params {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn HELPERS_NGX_D3D12_CREATE_DLSS_EXT(
        pInCmdList: *mut ID3D12GraphicsCommandList,
        InCreationNodeMask: ::std::os::raw::c_uint,
        InVisibilityNodeMask: ::std::os::raw::c_uint,
        ppOutHandle: *mut *mut NVSDK_NGX_Handle,
        pInParams: *mut NVSDK_NGX_Parameter,
        pInDlssCreateParams: *mut NVSDK_NGX_DLSS_Create_Params,
    ) -> NVSDK_NGX_Result;
}
extern "C" {
    pub fn HELPERS_NGX_D3D12_EVALUATE_DLSS_EXT(
        pInCmdList: *mut ID3D12GraphicsCommandList,
        pInHandle: *mut NVSDK_NGX_Handle,
        pInParams: *mut NVSDK_NGX_Parameter,
        pInDlssEvalParams: *mut NVSDK_NGX_D3D12_DLSS_Eval_Params,
    ) -> NVSDK_NGX_Result;
}
